{
  "id": 10,
  "metadata": {
    "id": 10,
    "length": 42,
    "arabic": {
      "title": "الأربعون النووية",
      "author": "الإمام يحيى بن شرف النووي",
      "introduction": ""
    },
    "english": {
      "title": "The Forty Hadith of Imam Nawawi",
      "author": "Imam Yahya ibn Sharaf al-Nawawi",
      "introduction": ""
    }
  },
  "chapters": [
    {
      "id": 0,
      "bookId": 10,
      "arabic": "الأربعون النووية",
      "english": "Forty Hadith of an-Nawawi"
    }
  ],
  "hadiths": [
    {
      "id": 40944,
      "idInBook": 1,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الأعمال بالنيات",
      "narrator": {
        "arabic": "عُمَرُ بْنُ الْخَطَّابِ",
        "english": "Umar ibn al-Khattab",
        "kunya_arabic": "أمير المؤمنين",
        "kunya_english": "Amir al-Mu'minin",
        "full_name_arabic": "عُمَرُ بْنُ الْخَطَّابِ",
        "full_name_english": "Umar ibn al-Khattab",
        "title_arabic": "أمير المؤمنين، الفاروق",
        "title_english": "Amir al-Mu'minin, al-Faruq",
        "died_ah": 23,
        "died_ce": 644,
        "tribe_arabic": "قريش - بنو عدي",
        "tribe_english": "Quraysh - Banu Adi",
        "is_ten_promised_paradise": true,
        "is_companion": true,
        "narrations_count": 537,
        "bio_arabic": "ثاني الخلفاء الراشدين، أسلم في السنة السادسة من البعثة، وكان إسلامه فتحاً وعزاً للمسلمين.",
        "bio_english": "Second of the Rightly-Guided Caliphs. Embraced Islam in the sixth year of the prophethood, his conversion was a great strengthening for the Muslims."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: \" إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ\"",
      "english": {
        "narrator": "It is narrated on the authority of Amirul Mu'minin, Abu Hafs 'Umar bin al-Khattab (ra) who said:",
        "text": "I heard the Messenger of Allah (ﷺ) say: \"Actions are (judged) by motives (niyyah), so each man will have what he intended. Thus, he whose migration (hijrah) was to Allah and His Messenger, his migration is to Allah and His Messenger; but he whose migration was for some worldly thing he might gain, or for a wife he might marry, his migration is to that for which he migrated.\"\n\n"
      },
      "vocabulary": [
        "النية: القصد والعزم، ومحلها القلب، وهي تميز العبادات عن العادات.",
        "هجرته: الانتقال من دار الخوف إلى دار الأمن، أو من المعصية إلى الطاعة.",
        "امرأة ينكحها: يريد زواجها.",
        "يصيبها: يحصل عليها."
      ],
      "benefits": [
        "النية هي معيار قبول الأعمال وصلاحها عند الله.",
        "التمييز بين العبادة والعادة يكون بالنية.",
        "وجوب الإخلاص لله تعالى، فمن نوى بعمله الدنيا لم يكن له في الآخرة نصيب.",
        "فضل الهجرة في سبيل الله، وأن الثواب يعظم بعظم القصد."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "النية",
          "الإخلاص",
          "الأعمال",
          "الهجرة"
        ],
        "english": [
          "Intention",
          "Sincerity",
          "Deeds",
          "Migration"
        ],
        "category_arabic": "العقيدة والأخلاق",
        "category_english": "Creed & Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ",
      "arabic_hadith_text": "\" إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ\"",
      "arabic_plain": "عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \" إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه\"",
      "arabic_hadith_text_plain": "\" إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه\"",
      "related_hadiths": [
        5,
        37,
        26,
        38
      ]
    },
    {
      "id": 40945,
      "idInBook": 2,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "مراتب الدين (حديث جبريل)",
      "narrator": {
        "arabic": "عُمَرُ بْنُ الْخَطَّابِ",
        "english": "Umar ibn al-Khattab",
        "kunya_arabic": "أمير المؤمنين",
        "kunya_english": "Amir al-Mu'minin",
        "full_name_arabic": "عُمَرُ بْنُ الْخَطَّابِ",
        "full_name_english": "Umar ibn al-Khattab",
        "title_arabic": "أمير المؤمنين، الفاروق",
        "title_english": "Amir al-Mu'minin, al-Faruq",
        "died_ah": 23,
        "died_ce": 644,
        "tribe_arabic": "قريش - بنو عدي",
        "tribe_english": "Quraysh - Banu Adi",
        "is_ten_promised_paradise": true,
        "is_companion": true,
        "narrations_count": 537,
        "bio_arabic": "ثاني الخلفاء الراشدين، أسلم في السنة السادسة من البعثة، وكان إسلامه فتحاً وعزاً للمسلمين.",
        "bio_english": "Second of the Rightly-Guided Caliphs. Embraced Islam in the sixth year of the prophethood, his conversion was a great strengthening for the Muslims."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضًا قَالَ: \" بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه و سلم ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعْرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ. حَتَّى جَلَسَ إلَى النَّبِيِّ صلى الله عليه و سلم . فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، \nوَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ. \nفَقَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إنْ اسْتَطَعْت إلَيْهِ سَبِيلًا. \nقَالَ: صَدَقْت . فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ!\nقَالَ: فَأَخْبِرْنِي عَنْ الْإِيمَانِ. \nقَالَ: أَنْ تُؤْمِنَ بِاَللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ.\nقَالَ: صَدَقْت. قَالَ: فَأَخْبِرْنِي عَنْ الْإِحْسَانِ. \nقَالَ: أَنْ تَعْبُدَ اللَّهَ كَأَنَّك تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاك. \nقَالَ: فَأَخْبِرْنِي عَنْ السَّاعَةِ. قَالَ: مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ. \nقَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا؟ قَالَ: أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ. ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا، \nثُمَّ قَالَ: يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ؟. \nقُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. \nقَالَ: فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ \". \n",
      "english": {
        "narrator": "Also on the authority of `Umar (ra) who said:",
        "text": "While we were one day sitting with the Messenger of Allah (ﷺ) there appeared before us a man dressed in extremely white clothes and with very black hair. No traces of journeying were visible on him, and none of us knew him.\n\nHe sat down close by the Prophet (ﷺ) rested his knees against the knees of the Prophet (ﷺ) and placed his palms over his thighs, and said: \"O Muhammad! Inform me about Islam.\" The Messenger of Allah (ﷺ) replied: \"Islam is that you should testify that there is no deity worthy of worship except Allah and that Muhammad is His Messenger (ﷺ), that you should perform salah (ritual prayer), pay the zakah, fast during Ramadan, and perform Hajj (pilgrimage) to the House (the Ka`bah at Makkah), if you can find a way to it (or find the means for making the journey to it).\" He said: \"You have spoken the truth.\"\n\nWe were astonished at his thus questioning him (ﷺ) and then telling him that he was right, but he went on to say, \"Inform me about Iman (faith).\" He (the Prophet) answered, \"It is that you believe in Allah and His angels and His Books and His Messengers and in the Last Day, and in fate (qadar), both in its good and in its evil aspects.\" He said, \"You have spoken the truth.\"\n\nThen he (the man) said, \"Inform me about Ihsan.\" He (the Prophet) answered, \"It is that you should serve Allah as though you could see Him, for though you cannot see Him yet He sees you.\"\n\nHe said, \"Inform me about the Hour.\" He (the Prophet) said, \"About that the one questioned knows no more than the questioner.\" So he said, \"Well, inform me about its signs.\" He said, \"They are that the slave-girl will give birth to her mistress and that you will see the barefooted ones, the naked, the destitute, the herdsmen of the sheep (competing with each other) in raising lofty buildings.\" Thereupon the man went off.\n\nI waited a while, and then he (the Prophet) said, \"O `Umar, do you know who that questioner was?\" I replied, \"Allah and His Messenger know better.\" He said, \"That was Jibril. He came to teach you your religion.\"\n\n"
      },
      "vocabulary": [
        "أسند ركبتيه: جلس جلسة المتعلم المتأدب أمام المعلم.",
        "الإسلام: الأعمال الظاهرة من صلاة وزكاة وغيرها.",
        "الإيمان: الاعتقاد الجازم بالقلب بأصول الدين.",
        "الإحسان: إتقان العبادة واستشعار مراقبة الله.",
        "أماراتها: علاماتها الدالة على قرب وقوعها.",
        "ربتها: سيدتها (كناية عن كثرة العقوق أو كثرة السراري).",
        "العالة: الفقراء."
      ],
      "benefits": [
        "بيان مراتب الدين الثلاثة: الإسلام، والإيمان، والإحسان.",
        "أهمية التأدب في مجالس العلم، كما فعل جبريل عليه السلام.",
        "جواز السؤال لتعليم الحاضرين وإن كان السائل يعلم الجواب.",
        "إثبات علم الغيب لله وحده، وأن الساعة لا يعلم وقتها نبي مرسل ولا ملك مقرب."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الإسلام",
          "الإيمان",
          "الإحسان",
          "أركان الدين",
          "القدر",
          "يوم القيامة"
        ],
        "english": [
          "Islam",
          "Faith",
          "Ihsan",
          "Pillars of Religion",
          "Divine Decree",
          "Day of Judgment"
        ],
        "category_arabic": "أركان الدين",
        "category_english": "Pillars of Religion"
      },
      "arabic_narrator_intro": "عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضًا قَالَ",
      "arabic_hadith_text": "\" بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه و سلم ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعْرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ. حَتَّى جَلَسَ إلَى النَّبِيِّ صلى الله عليه و سلم . فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، \nوَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ. \nفَقَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إنْ اسْتَطَعْت إلَيْهِ سَبِيلًا. \nقَالَ: صَدَقْت . فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ!\nقَالَ: فَأَخْبِرْنِي عَنْ الْإِيمَانِ. \nقَالَ: أَنْ تُؤْمِنَ بِاَللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ.\nقَالَ: صَدَقْت. قَالَ: فَأَخْبِرْنِي عَنْ الْإِحْسَانِ. \nقَالَ: أَنْ تَعْبُدَ اللَّهَ كَأَنَّك تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاك. \nقَالَ: فَأَخْبِرْنِي عَنْ السَّاعَةِ. قَالَ: مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ. \nقَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا؟ قَالَ: أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ. ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا، \nثُمَّ قَالَ: يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ؟. \nقُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. \nقَالَ: فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ \"",
      "arabic_plain": "عن عمر رضي الله عنه أيضا قال: \" بينما نحن جلوس عند رسول الله صلى الله عليه و سلم ذات يوم، إذ طلع علينا رجل شديد بياض الثياب، شديد سواد الشعر، لا يرى عليه أثر السفر، ولا يعرفه منا أحد. حتى جلس إلى النبي صلى الله عليه و سلم . فأسند ركبتيه إلى ركبتيه، ووضع كفيه على فخذيه، \nوقال: يا محمد أخبرني عن الإسلام. \nفقال رسول الله صلى الله عليه و سلم الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعت إليه سبيلا. \nقال: صدقت . فعجبنا له يسأله ويصدقه!\nقال: فأخبرني عن الإيمان. \nقال: أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خيره وشره.\nقال: صدقت. قال: فأخبرني عن الإحسان. \nقال: أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك. \nقال: فأخبرني عن الساعة. قال: ما المسئول عنها بأعلم من السائل. \nقال: فأخبرني عن أماراتها؟ قال: أن تلد الأمة ربتها، وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان. ثم انطلق، فلبثت مليا، \nثم قال: يا عمر أتدري من السائل؟. \nقلت: الله ورسوله أعلم. \nقال: فإنه جبريل أتاكم يعلمكم دينكم \". \n",
      "arabic_hadith_text_plain": "\" بينما نحن جلوس عند رسول الله صلى الله عليه و سلم ذات يوم، إذ طلع علينا رجل شديد بياض الثياب، شديد سواد الشعر، لا يرى عليه أثر السفر، ولا يعرفه منا أحد. حتى جلس إلى النبي صلى الله عليه و سلم . فأسند ركبتيه إلى ركبتيه، ووضع كفيه على فخذيه، \nوقال: يا محمد أخبرني عن الإسلام. \nفقال رسول الله صلى الله عليه و سلم الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعت إليه سبيلا. \nقال: صدقت . فعجبنا له يسأله ويصدقه!\nقال: فأخبرني عن الإيمان. \nقال: أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خيره وشره.\nقال: صدقت. قال: فأخبرني عن الإحسان. \nقال: أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك. \nقال: فأخبرني عن الساعة. قال: ما المسئول عنها بأعلم من السائل. \nقال: فأخبرني عن أماراتها؟ قال: أن تلد الأمة ربتها، وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان. ثم انطلق، فلبثت مليا، \nثم قال: يا عمر أتدري من السائل؟. \nقلت: الله ورسوله أعلم. \nقال: فإنه جبريل أتاكم يعلمكم دينكم \"",
      "related_hadiths": [
        22,
        13,
        15,
        21
      ]
    },
    {
      "id": 40946,
      "idInBook": 3,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "أركان الإسلام",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عُمَرَ",
        "english": "Abdullah ibn Umar",
        "kunya_arabic": "أبو عبد الرحمن",
        "kunya_english": "Abu Abd al-Rahman",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عُمَرَ",
        "full_name_english": "Abdullah ibn Umar",
        "title_arabic": "ابن الفاروق",
        "title_english": "Son of al-Faruq",
        "died_ah": 73,
        "died_ce": 692,
        "tribe_arabic": "قريش - بنو عدي",
        "tribe_english": "Quraysh - Banu Adi",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 2630,
        "bio_arabic": "من أكثر الصحابة رواية للحديث، عُرف بشدة اتباعه لسنة النبي ﷺ حتى في أدق التفاصيل.",
        "bio_english": "One of the most prolific narrators of hadith among the Companions, known for his strict adherence to the Prophet's Sunnah in the finest details."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \" بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ\". \n",
      "english": {
        "narrator": "On the authority of Abdullah, the son of Umar ibn al-Khattab (ra), who said:",
        "text": "I heard the Messenger of Allah (ﷺ) say, \"Islam has been built on five : testifying that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, establishing the salah (prayer), paying the zakat (obligatory charity), making the hajj (pilgrimage) to the House, and fasting in Ramadhan.\"\n\n"
      },
      "vocabulary": [
        "بني الإسلام: شُبّه الإسلام بخيمة عظيمة أو بناء قوي له أعمدة.",
        "إقام الصلاة: أداؤها كاملة الأركان والشروط وفي أوقاتها.",
        "إيتاء الزكاة: إخراج القدر الواجب من المال للمستحقين.",
        "حج البيت: قصد الكعبة لأداء المناسك."
      ],
      "benefits": [
        "تشبيه الإسلام بالبناء، وهذه الخمس هي دعائمه الأساسية.",
        "الشهادتان هما أساس الدين وشرط صحة بقية الأعمال.",
        "أهمية الصلاة والزكاة والصوم والحج كشعائر عظمى للإسلام.",
        "الترابط بين العبادة البدنية (كالصلاة) والمالية (كالزكاة) في الإسلام."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "أركان الإسلام",
          "الصلاة",
          "الزكاة",
          "الصوم",
          "الحج",
          "الشهادة"
        ],
        "english": [
          "Pillars of Islam",
          "Prayer",
          "Zakat",
          "Fasting",
          "Hajj",
          "Testimony"
        ],
        "category_arabic": "العبادات",
        "category_english": "Acts of Worship"
      },
      "arabic_narrator_intro": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ",
      "arabic_hadith_text": "\" بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ\"",
      "arabic_plain": "عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: سمعت رسول الله صلى الله عليه و سلم يقول: \" بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان\". \n",
      "arabic_hadith_text_plain": "\" بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان\"",
      "related_hadiths": [
        8,
        25,
        23,
        29
      ]
    },
    {
      "id": 40947,
      "idInBook": 4,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "مراحل الخلق والخواتيم",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ مَسْعُودٍ",
        "english": "Abdullah ibn Masud",
        "kunya_arabic": "أبو عبد الرحمن",
        "kunya_english": "Abu Abd al-Rahman",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ مَسْعُودٍ",
        "full_name_english": "Abdullah ibn Masud",
        "title_arabic": "فقيه الأمة",
        "title_english": "Jurist of the Ummah",
        "died_ah": 32,
        "died_ce": 652,
        "tribe_arabic": "هذيل",
        "tribe_english": "Hudhayl",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 848,
        "bio_arabic": "من السابقين الأولين إلى الإسلام، كان من أشد الناس معرفة بالقرآن وعلوم الدين.",
        "bio_english": "Among the first to embrace Islam, he was known as one of the most knowledgeable Companions in Quranic sciences and religious knowledge."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه و سلم -وَهُوَ الصَّادِقُ الْمَصْدُوقُ-: \"إنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٍّ أَمْ سَعِيدٍ؛ فَوَاَللَّهِ الَّذِي لَا إلَهَ غَيْرُهُ إنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا. وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا\".\n \n",
      "english": {
        "narrator": "On the authority of Abdullah ibn Masood (ra), who said:",
        "text": "The Messenger of Allah (ﷺ), and he is the truthful, the believed, narrated to us, “Verily the creation of each one of you is brought together in his mother’s womb for forty days in the form of a nutfah (a drop), then he becomes an alaqah (clot of blood) for a like period, then a mudghah (morsel of flesh) for a like period, then there is sent to him the angel who blows his soul into him and who is commanded with four matters: to write down his rizq (sustenance), his life span, his actions, and whether he will be happy or unhappy (i.e., whether or not he will enter Paradise).\n\nBy the One, other than Whom there is no deity, verily one of you performs the actions of the people of Paradise until there is but an arms length between him and it, and that which has been written overtakes him, and so he acts with the actions of the people of the Hellfire and thus enters it; and verily one of you performs the actions of the people of the Hellfire, until there is but an arms length between him and it, and that which has been written overtakes him and so he acts with the actions of the people of Paradise and thus he enters it.”\n\n"
      },
      "vocabulary": [
        "الصادق المصدوق: الصادق في قوله، المصدوق فيما يأتيه من الوحي.",
        "نطفة: ماء الرجل والمرأة إذا اجتمعا.",
        "علقة: قطعة دم متجمد تعلق بجدار الرحم.",
        "مضغة: قطعة لحم صغيرة بقدر ما يمضغ.",
        "الكتاب: ما كتبه الله في اللوح المحفوظ."
      ],
      "benefits": [
        "بيان أطوار خلق الإنسان وقدرة الله العظيمة.",
        "نفخ الروح في الجنين يكون بعد مئة وعشرين يوماً.",
        "كتابة الآجال والأرزاق والسعادة والشقاء والإنسان في بطن أمه.",
        "العبرة بالخواتيم، والخوف من سوء الخاتمة يوجب دوام الافتقار إلى الله."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "خلق الإنسان",
          "القدر",
          "الجنة والنار",
          "الروح",
          "الكتاب المقدر"
        ],
        "english": [
          "Human Creation",
          "Divine Decree",
          "Heaven & Hell",
          "Soul",
          "Predestination"
        ],
        "category_arabic": "العقيدة",
        "category_english": "Creed"
      },
      "arabic_narrator_intro": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه و سلم -وَهُوَ الصَّادِقُ الْمَصْدُوقُ-",
      "arabic_hadith_text": "\"إنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٍّ أَمْ سَعِيدٍ؛ فَوَاَللَّهِ الَّذِي لَا إلَهَ غَيْرُهُ إنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا. وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا\"",
      "arabic_plain": "عن أبي عبد الرحمن عبد الله بن مسعود رضي الله عنه قال: حدثنا رسول الله صلى الله عليه و سلم -وهو الصادق المصدوق-: \"إن أحدكم يجمع خلقه في بطن أمه أربعين يوما نطفة، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يرسل إليه الملك فينفخ فيه الروح، ويؤمر بأربع كلمات: بكتب رزقه، وأجله، وعمله، وشقي أم سعيد؛ فوالله الذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها. وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها\".\n \n",
      "arabic_hadith_text_plain": "\"إن أحدكم يجمع خلقه في بطن أمه أربعين يوما نطفة، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يرسل إليه الملك فينفخ فيه الروح، ويؤمر بأربع كلمات: بكتب رزقه، وأجله، وعمله، وشقي أم سعيد؛ فوالله الذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها. وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها\"",
      "related_hadiths": [
        2,
        19,
        37
      ]
    },
    {
      "id": 40948,
      "idInBook": 5,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "النهي عن الابتداع في الدين",
      "narrator": {
        "arabic": "عَائِشَةُ أُمُّ الْمُؤْمِنِينَ",
        "english": "Aisha (Mother of the Believers)",
        "kunya_arabic": "أم المؤمنين",
        "kunya_english": "Mother of the Believers",
        "full_name_arabic": "عَائِشَةُ بِنْتُ أَبِي بَكْرٍ",
        "full_name_english": "Aisha bint Abi Bakr",
        "title_arabic": "الصدّيقة بنت الصدّيق",
        "title_english": "al-Siddiqah bint al-Siddiq",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "قريش - بنو تيم",
        "tribe_english": "Quraysh - Banu Taym",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 2210,
        "bio_arabic": "زوج النبي ﷺ، من أعلم نساء الأمة الإسلامية وأكثرهن رواية للحديث.",
        "bio_english": "Wife of the Prophet ﷺ, one of the most knowledgeable women in Islamic history and among the most prolific narrators of hadith."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللَّهِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، قَالَتْ: قَالَ: رَسُولُ اللَّهِ صلى الله عليه و سلم \"مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ\n \nوَفِي رِوَايَةٍ لِمُسْلِمٍ: مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ\"",
      "english": {
        "narrator": "On the authority of the mother of the faithful, Aisha (ra), who said:",
        "text": "The Messenger of Allah (ﷺ) said, “He who innovates something in this matter of ours (i.e., Islam) that is not of it will have it rejected (by Allah).”\n\n\nIn another version in Muslim it reads: “He who does an act which we have not commanded, will have it rejected (by Allah).”"
      },
      "vocabulary": [
        "أحدث: أنشأ وابتدع طريقة جديدة.",
        "أمرنا هذا: دين الإسلام وشريعته.",
        "ليس منه: لا يستند إلى دليل شرعي.",
        "رد: مردود على فاعله، باطل غير مقبول."
      ],
      "benefits": [
        "هذا الحديث ميزان للأعمال الظاهرة (ألا تكون بدعة).",
        "كل عبادة لم يشرعها الله ورسوله فهي باطلة ومردودة.",
        "حماية الدين من التحريف والزيادة والنقصان.",
        "وجوب الاتباع وذم الابتداع."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "البدعة",
          "الشريعة",
          "رد الأعمال",
          "السنة"
        ],
        "english": [
          "Innovation",
          "Islamic Law",
          "Rejection of Deeds",
          "Sunnah"
        ],
        "category_arabic": "الفقه والشريعة",
        "category_english": "Jurisprudence & Law"
      },
      "arabic_narrator_intro": "عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللَّهِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، قَالَتْ: قَالَ: رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ\nوَفِي رِوَايَةٍ لِمُسْلِمٍ: مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ\"",
      "arabic_plain": "عن أم المؤمنين أم عبد الله عائشة رضي الله عنها، قالت: قال: رسول الله صلى الله عليه و سلم \"من أحدث في أمرنا هذا ما ليس منه فهو رد\n \nوفي رواية لمسلم: من عمل عملا ليس عليه أمرنا فهو رد\"",
      "arabic_hadith_text_plain": "\"من أحدث في أمرنا هذا ما ليس منه فهو رد\nوفي رواية لمسلم: من عمل عملا ليس عليه أمرنا فهو رد\"",
      "related_hadiths": [
        28,
        20
      ]
    },
    {
      "id": 40949,
      "idInBook": 6,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "البعد عن الشبهات",
      "narrator": {
        "arabic": "النُّعْمَانُ بْنُ بَشِيرٍ",
        "english": "al-Nu'man ibn Bashir",
        "kunya_arabic": "أبو عبد الله",
        "kunya_english": "Abu Abdullah",
        "full_name_arabic": "النُّعْمَانُ بْنُ بَشِيرٍ الْأَنْصَارِيُّ",
        "full_name_english": "al-Nu'man ibn Bashir al-Ansari",
        "title_arabic": "",
        "title_english": "",
        "died_ah": 65,
        "died_ce": 684,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 114,
        "bio_arabic": "أول مولود من الأنصار بعد الهجرة، ولاّه معاوية رضي الله عنه على الكوفة والشام.",
        "bio_english": "The first child born to the Ansar after the Hijra. Muawiyah appointed him governor of Kufa and later Syria."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"إنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقْد اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ\". \n \n",
      "english": {
        "narrator": "On the authority of an-Nu’man ibn Basheer (ra), who said:",
        "text": "I heard the Messenger of Allah (ﷺ) say, “That which is lawful is clear and that which is unlawful is clear, and between the two of them are doubtful matters about which many people do not know. Thus he who avoids doubtful matters clears himself in regard to his religion and his honor, but he who falls into doubtful matters  is diseased. Truly, it is the heart.”\n\n"
      },
      "vocabulary": [
        "مشتبهات: أمور تتجاذبها أدلة الحل والحرمة، فليست واضحة لكل أحد.",
        "استبرأ لدينه: طلب البراءة والسلامة لدينه من النقص.",
        "الحمى: المكان المحمي الذي يمنع الناس من دخوله.",
        "يرتع فيه: تأكل ماشيته منه."
      ],
      "benefits": [
        "الورع هو ترك الشبهات خوفاً من الوقوع في الحرام.",
        "حماية الأعراض وصيانة الدين من القيل والقال.",
        "القلب هو ملك الجوارح، بصلاحه تصلح وبفساده تفسد.",
        "سد الذرائع (الطرق) المؤدية إلى المحرمات."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الحلال والحرام",
          "الشبهات",
          "الورع",
          "القلب",
          "حفظ العرض"
        ],
        "english": [
          "Halal & Haram",
          "Doubtful Matters",
          "Piety",
          "Heart",
          "Honor"
        ],
        "category_arabic": "الأخلاق والورع",
        "category_english": "Ethics & Piety"
      },
      "arabic_narrator_intro": "عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ",
      "arabic_hadith_text": "\"إنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقْد اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ\"",
      "arabic_plain": "عن أبي عبد الله النعمان بن بشير رضي الله عنهما، قال: سمعت رسول الله صلى الله عليه و سلم يقول: \"إن الحلال بين، وإن الحرام بين، وبينهما أمور مشتبهات لا يعلمهن كثير من الناس، فمن اتقى الشبهات فقد استبرأ لدينه وعرضه، ومن وقع في الشبهات وقع في الحرام، كالراعي يرعى حول الحمى يوشك أن يرتع فيه، ألا وإن لكل ملك حمى، ألا وإن حمى الله محارمه، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله، وإذا فسدت فسد الجسد كله، ألا وهي القلب\". \n \n",
      "arabic_hadith_text_plain": "\"إن الحلال بين، وإن الحرام بين، وبينهما أمور مشتبهات لا يعلمهن كثير من الناس، فمن اتقى الشبهات فقد استبرأ لدينه وعرضه، ومن وقع في الشبهات وقع في الحرام، كالراعي يرعى حول الحمى يوشك أن يرتع فيه، ألا وإن لكل ملك حمى، ألا وإن حمى الله محارمه، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله، وإذا فسدت فسد الجسد كله، ألا وهي القلب\"",
      "related_hadiths": [
        11,
        27
      ]
    },
    {
      "id": 40950,
      "idInBook": 7,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الدين النصيحة",
      "narrator": {
        "arabic": "تَمِيمُ بْنُ أَوْسٍ الدَّارِيُّ",
        "english": "Tamim ibn Aws al-Dari",
        "kunya_arabic": "أبو رقية",
        "kunya_english": "Abu Ruqayyah",
        "full_name_arabic": "تَمِيمُ بْنُ أَوْسٍ الدَّارِيُّ",
        "full_name_english": "Tamim ibn Aws al-Dari",
        "title_arabic": "الراهب",
        "title_english": "The Devout Worshipper",
        "died_ah": 40,
        "died_ce": 661,
        "tribe_arabic": "لخم",
        "tribe_english": "Lakhm",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 18,
        "bio_arabic": "كان نصرانياً فأسلم سنة 9 هـ، مشهور بطول القيام في الصلاة وكثرة العبادة.",
        "bio_english": "Was a Christian who embraced Islam in 9 AH. Known for his lengthy night prayers and abundant worship."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي رُقَيَّةَ تَمِيمِ بْنِ أَوْسٍ الدَّارِيِّ رَضِيَ اللهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: \"الدِّينُ النَّصِيحَةُ.\" قُلْنَا: لِمَنْ؟ قَالَ: \"لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ.\"",
      "english": {
        "narrator": "On the authority of Tameem ibn Aus ad-Daree (ra):",
        "text": "The Prophet (ﷺ) said, “The deen (religion) is naseehah (advice, sincerity).” We said, “To whom?” He (ﷺ) said, “To Allah, His Book, His Messenger, and to the leaders of the Muslims and their common folk.”\n\n"
      },
      "vocabulary": [
        "النصيحة: كلمة جامعة تعني حيازت الخير للمنصوح له.",
        "لله: الإيمان به وتوحيده وطاعته.",
        "لكتابه: تلاوته والعمل به وتدبره.",
        "لأئمة المسلمين: إعانتهم على الحق وطاعتهم في غير معصية.",
        "عامتهـم: إرشادهم للخير وكف الأذى عنهم."
      ],
      "benefits": [
        "الدين كله يرجع إلى التناصح وإرادة الخير.",
        "شمولية النصيحة للحاكم والمحكوم والعالم والجاهل.",
        "النصيحة ليست مجرد كلام، بل هي عمل وسلوك.",
        "أهمية الأمر بالمعروف والنهي عن المنكر برفق وحكمة."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "النصيحة",
          "الدين",
          "الولاة",
          "الإخلاص للمسلمين"
        ],
        "english": [
          "Advice",
          "Religion",
          "Leaders",
          "Sincerity to Muslims"
        ],
        "category_arabic": "الأخلاق والمجتمع",
        "category_english": "Ethics & Society"
      },
      "arabic_narrator_intro": "عَنْ أَبِي رُقَيَّةَ تَمِيمِ بْنِ أَوْسٍ الدَّارِيِّ رَضِيَ اللهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ",
      "arabic_hadith_text": "\"الدِّينُ النَّصِيحَةُ.\" قُلْنَا: لِمَنْ؟ قَالَ: \"لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ.\"",
      "arabic_plain": "عن أبي رقية تميم بن أوس الداري رضي الله عنه أن النبي صلى الله عليه وسلم قال: \"الدين النصيحة.\" قلنا: لمن؟ قال: \"لله، ولكتابه، ولرسوله، ولأئمة المسلمين وعامتهم.\"",
      "arabic_hadith_text_plain": "\"الدين النصيحة.\" قلنا: لمن؟ قال: \"لله، ولكتابه، ولرسوله، ولأئمة المسلمين وعامتهم.\"",
      "related_hadiths": [
        34,
        28,
        15
      ]
    },
    {
      "id": 40951,
      "idInBook": 8,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "حرمة دم المسلم وماله",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عُمَرَ",
        "english": "Abdullah ibn Umar",
        "kunya_arabic": "أبو عبد الرحمن",
        "kunya_english": "Abu Abd al-Rahman",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عُمَرَ",
        "full_name_english": "Abdullah ibn Umar",
        "title_arabic": "ابن الفاروق",
        "title_english": "Son of al-Faruq",
        "died_ah": 73,
        "died_ce": 692,
        "tribe_arabic": "قريش - بنو عدي",
        "tribe_english": "Quraysh - Banu Adi",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 2630,
        "bio_arabic": "من أكثر الصحابة رواية للحديث، عُرف بشدة اتباعه لسنة النبي ﷺ حتى في أدق التفاصيل.",
        "bio_english": "One of the most prolific narrators of hadith among the Companions, known for his strict adherence to the Prophet's Sunnah in the finest details."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا، أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ؛ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إلَّا بِحَقِّ الْإِسْلَامِ، وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى\" ",
      "english": {
        "narrator": "On the authority of Abdullah ibn Umar (ra):",
        "text": "The Messenger of Allah (ﷺ) said, \"I have been ordered to fight against the people until they testify that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah, and until they establish the salah and pay the zakat. And if they do that then they will have gained protection from me for their lives and property, unless  in Islam, and their reckoning will be with Allah.\"\n\n"
      },
      "vocabulary": [
        "أقاتل الناس: المقصود هنا المشركون المحاربون.",
        "عصموا: منعوا وحفظوا.",
        "بحق الإسلام: كالقصاص أو الحدود الشرعية.",
        "حسابهم على الله: الله يتولى سرائرهم."
      ],
      "benefits": [
        "عصمة الدماء والأموال تتحقق بالنطق بالشهادتين وإقامة الصلاة والزكاة.",
        "الأحكام في الدنيا تبنى على الظاهر، والسرائر موكولة إلى الله.",
        "عظم شأن الصلاة والزكاة وأنهما من شروط الأخوة الإسلامية الكاملة."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الجهاد",
          "الشهادة",
          "قتال المشركين",
          "الصلاة",
          "الزكاة"
        ],
        "english": [
          "Jihad",
          "Testimony of Faith",
          "Fighting Polytheists",
          "Prayer",
          "Zakat"
        ],
        "category_arabic": "الجهاد والعقيدة",
        "category_english": "Jihad & Creed"
      },
      "arabic_narrator_intro": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا، أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ؛ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إلَّا بِحَقِّ الْإِسْلَامِ، وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى\"",
      "arabic_plain": "عن ابن عمر رضي الله عنهما، أن رسول الله صلى الله عليه و سلم قال: \"أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة؛ فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله تعالى\" ",
      "arabic_hadith_text_plain": "\"أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة؛ فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله تعالى\"",
      "related_hadiths": [
        3,
        29,
        33,
        23
      ]
    },
    {
      "id": 40952,
      "idInBook": 9,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "النهي عن كثرة السؤال والتكلف",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ \"",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (ra):",
        "text": "I heard the Messenger of Allah (ﷺ) say, “What I have forbidden for you, avoid. What I have ordered you  who were before you.”\n\n"
      },
      "vocabulary": [
        "فاجتنبوه: ابتعدوا عنه بالكلية.",
        "ما استطعتم: افعلوا منه بقدر قدرتكم وطاقتكم.",
        "أهلك الذين من قبلكم: الأمم السابقة.",
        "الاختلاف على الأنبياء: مخالفتهم وعصيانهم."
      ],
      "benefits": [
        "النهي يقتضي الترك الفوري والكامل (لا يُعذر فيه إلا المضطر).",
        "الأمر مقيد بالاستطاعة (لا يكلف الله نفساً إلا وسعها).",
        "التحذير من كثرة الأسئلة الفضولية أو التعنتية.",
        "سبب هلاك الأمم السابقة كان المخالفة والجدال."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الأوامر والنواهي",
          "التكليف",
          "المنهج الإسلامي",
          "الطاعة"
        ],
        "english": [
          "Commands & Prohibitions",
          "Obligation",
          "Islamic Method",
          "Obedience"
        ],
        "category_arabic": "الفقه والمنهج",
        "category_english": "Jurisprudence & Method"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ",
      "arabic_hadith_text": "\"مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ \"",
      "arabic_plain": "عن أبي هريرة عبد الرحمن بن صخر رضي الله عنه قال: سمعت رسول الله صلى الله عليه و سلم يقول: \"ما نهيتكم عنه فاجتنبوه، وما أمرتكم به فأتوا منه ما استطعتم، فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم \"",
      "arabic_hadith_text_plain": "\"ما نهيتكم عنه فاجتنبوه، وما أمرتكم به فأتوا منه ما استطعتم، فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم \"",
      "related_hadiths": [
        5,
        28,
        30,
        17
      ]
    },
    {
      "id": 40953,
      "idInBook": 10,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "أسباب إجابة الدعاء",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"إنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إلَّا طَيِّبًا، وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ تَعَالَى: \"يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا\"، وَقَالَ تَعَالَى: \"يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ\" ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إلَى السَّمَاءِ: يَا رَبِّ! يَا رَبِّ! وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِّيَ بِالْحَرَامِ، فَأَنَّى يُسْتَجَابُ لَهُ؟\"",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (ra):",
        "text": "The Messenger of Allah (ﷺ) said, “Allah the Almighty is Good and accepts only that which is good. And verily Allah has commanded the believers to do that which He has commanded the Messengers.\n\nSo the Almighty has said: “O (you) Messengers! Eat of the tayyibat ”\n\nThen he (ﷺ) mentioned  be answered?\n\n"
      },
      "vocabulary": [
        "طيب: منزه عن كل نقص، ومقدس.",
        "أشعث أغبر: مفرق الشعر مغبر الوجه (كناية عن طول السفر والذل).",
        "أنى يستجاب لذلك: كيف يستجيب الله له وهو غارق في الحرام؟ (للاستبعاد)."
      ],
      "benefits": [
        "أكل الحلال شرط أساسي لقبول الدعاء والعبادات.",
        "الله غني عن عبادة العاصين، ولا يقبل إلا ما كان خالصاً من حلال.",
        "التوسل إلى الله بحال الفقر والسفر من أسباب الإجابة، لكن أكل الحرام يمنعها.",
        "وجوب تحري الحلال في المأكل والمشرب والملبس."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الحلال",
          "الطيب",
          "الرزق",
          "الدعاء",
          "الطعام الحلال"
        ],
        "english": [
          "Halal",
          "Pure",
          "Sustenance",
          "Supplication",
          "Lawful Food"
        ],
        "category_arabic": "الأخلاق والعبادة",
        "category_english": "Ethics & Worship"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"إنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إلَّا طَيِّبًا، وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ تَعَالَى: \"يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا\"، وَقَالَ تَعَالَى: \"يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ\" ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إلَى السَّمَاءِ: يَا رَبِّ! يَا رَبِّ! وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِّيَ بِالْحَرَامِ، فَأَنَّى يُسْتَجَابُ لَهُ؟\"",
      "arabic_plain": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم \"إن الله طيب لا يقبل إلا طيبا، وإن الله أمر المؤمنين بما أمر به المرسلين فقال تعالى: \"يا أيها الرسل كلوا من الطيبات واعملوا صالحا\"، وقال تعالى: \"يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم\" ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء: يا رب! يا رب! ومطعمه حرام، ومشربه حرام، وملبسه حرام، وغذي بالحرام، فأنى يستجاب له؟\"",
      "arabic_hadith_text_plain": "\"إن الله طيب لا يقبل إلا طيبا، وإن الله أمر المؤمنين بما أمر به المرسلين فقال تعالى: \"يا أيها الرسل كلوا من الطيبات واعملوا صالحا\"، وقال تعالى: \"يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم\" ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء: يا رب! يا رب! ومطعمه حرام، ومشربه حرام، وملبسه حرام، وغذي بالحرام، فأنى يستجاب له؟\"",
      "related_hadiths": [
        42,
        39,
        25,
        23
      ]
    },
    {
      "id": 40954,
      "idInBook": 11,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الورع وترك الشبهات",
      "narrator": {
        "arabic": "الْحَسَنُ بْنُ عَلِيٍّ",
        "english": "al-Hasan ibn Ali",
        "kunya_arabic": "أبو محمد",
        "kunya_english": "Abu Muhammad",
        "full_name_arabic": "الْحَسَنُ بْنُ عَلِيِّ بْنِ أَبِي طَالِبٍ",
        "full_name_english": "al-Hasan ibn Ali ibn Abi Talib",
        "title_arabic": "سبط رسول الله، ريحانته",
        "title_english": "Grandson of the Messenger of Allah, His Beloved",
        "died_ah": 50,
        "died_ce": 670,
        "tribe_arabic": "قريش - بنو هاشم",
        "tribe_english": "Quraysh - Banu Hashim",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 13,
        "bio_arabic": "سبط النبي ﷺ وريحانته، تنازل عن الخلافة لمعاوية حقناً للدماء.",
        "bio_english": "Grandson of the Prophet ﷺ, relinquished the caliphate to Muawiyah to prevent bloodshed."
      },
      "source": {
        "books_arabic": [
          "سنن الترمذي",
          "سنن النسائي"
        ],
        "books_english": [
          "Jami al-Tirmidhi",
          "Sunan an-Nasai"
        ],
        "grade_arabic": "حسن صحيح",
        "grade_english": "Hasan Sahih"
      },
      "arabic": "عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ سِبْطِ رَسُولِ اللَّهِ صلى الله عليه و سلم وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: حَفِظْت مِنْ رَسُولِ اللَّهِ صلى الله عليه و سلم \"دَعْ مَا يُرِيبُك إلَى مَا لَا يُرِيبُك\"",
      "english": {
        "narrator": "On the authority of Abu Muhammad al-Hasan ibn Ali ibn Abee Talib (may Allah be pleased with him), the grandson of the Messenger of Allah (peace and blessings of Allah be upon him), and the one much loved by him, who said:",
        "text": "I memorised from the Messenger of Allah (peace and blessings of Allah be upon him): “Leave that which makes you doubt for that which does not make you doubt.”\n\n\n\nAt-Tirmidhi said that it was a good and sound (hasan saheeh) hadeeth."
      },
      "vocabulary": [
        "دع: اترك.",
        "ما يريبك: ما يوقعك في الشك والقلق.",
        "لا يريبك: ما تطمئن إليه وتتيقن حله."
      ],
      "benefits": [
        "قاعدة عظيمة في الورع: ترك المشكوك فيه واعتماد اليقين.",
        "الصدق طمأنينة للقلب، والكذب ريبة وقلق.",
        "من اتقى الشبهات فقد استراح نفسياً وسلم دينه."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الورع",
          "تجنب الشبهات",
          "الحلال والحرام",
          "اليقين"
        ],
        "english": [
          "Piety",
          "Avoiding Doubts",
          "Halal & Haram",
          "Certainty"
        ],
        "category_arabic": "الورع والزهد",
        "category_english": "Piety & Asceticism"
      },
      "arabic_narrator_intro": "عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ سِبْطِ رَسُولِ اللَّهِ صلى الله عليه و سلم وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: حَفِظْت مِنْ رَسُولِ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"دَعْ مَا يُرِيبُك إلَى مَا لَا يُرِيبُك\"",
      "arabic_plain": "عن أبي محمد الحسن بن علي بن أبي طالب سبط رسول الله صلى الله عليه و سلم وريحانته رضي الله عنهما، قال: حفظت من رسول الله صلى الله عليه و سلم \"دع ما يريبك إلى ما لا يريبك\"",
      "arabic_hadith_text_plain": "\"دع ما يريبك إلى ما لا يريبك\"",
      "related_hadiths": [
        6,
        27
      ]
    },
    {
      "id": 40955,
      "idInBook": 12,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الاشتغال بما يفيد",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "سنن الترمذي"
        ],
        "books_english": [
          "Jami al-Tirmidhi"
        ],
        "grade_arabic": "حسن",
        "grade_english": "Hasan"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"مِنْ حُسْنِ إسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ\". \nحَدِيثٌ حَسَنٌ،",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “Part of the perfection of one’s Islam is his leaving that which does not concern him.”\n\nA hasan (good) hadeeth which was related by at-Tirmidhi and others in this fashion."
      },
      "vocabulary": [
        "حسن إسلام المرء: كماله وجماله واستقامته.",
        "ما لا يعنيه: ما لا يهمه من أمر دينه ودنياه، وما لا فائدة فيه."
      ],
      "benefits": [
        "الحث على استغلال الوقت فيما ينفع.",
        "ترك التدخل في شؤون الناس وتتبع عوراتهم.",
        "الاشتغال بما لا يعني يضيع الدين والدنيا ويقسي القلب."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "حسن الإسلام",
          "اللغو",
          "التحفظ",
          "الكلام"
        ],
        "english": [
          "Excellence of Islam",
          "Vain Speech",
          "Restraint",
          "Speech"
        ],
        "category_arabic": "الأخلاق",
        "category_english": "Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"مِنْ حُسْنِ إسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ\"",
      "arabic_plain": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم \"من حسن إسلام المرء تركه ما لا يعنيه\". \nحديث حسن،",
      "arabic_hadith_text_plain": "\"من حسن إسلام المرء تركه ما لا يعنيه\"",
      "related_hadiths": [
        15,
        29,
        27
      ]
    },
    {
      "id": 40956,
      "idInBook": 13,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "محبة الخير للمؤمنين",
      "narrator": {
        "arabic": "أَنَسُ بْنُ مَالِكٍ",
        "english": "Anas ibn Malik",
        "kunya_arabic": "أبو حمزة",
        "kunya_english": "Abu Hamzah",
        "full_name_arabic": "أَنَسُ بْنُ مَالِكٍ الْأَنْصَارِيُّ",
        "full_name_english": "Anas ibn Malik al-Ansari",
        "title_arabic": "خادم رسول الله",
        "title_english": "Servant of the Messenger of Allah",
        "died_ah": 93,
        "died_ce": 712,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 2286,
        "bio_arabic": "خدم النبي ﷺ عشر سنوات من حين قدومه المدينة حتى وفاته، آخر من مات من الصحابة في البصرة.",
        "bio_english": "Served the Prophet ﷺ for ten years from his arrival in Madinah until his death. He was the last Companion to die in Basra."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه و سلم عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: \"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ\"",
      "english": {
        "narrator": "On the authority of Abu Hamzah Anas bin Malik (may Allah be pleased with him) — the servant of the Messenger of Allah (peace and blessings of Allah be upon him) — that the Prophet (peace and blessings of Allah be upon him) said:",
        "text": "None of you  believes until he loves for his brother that which he loves for himself. \n\n\n"
      },
      "vocabulary": [
        "لا يؤمن: نفي الكمال الواجب للإيمان، وليس نفي أصل الإيمان.",
        "لأخيه: أي أخيه في الإسلام.",
        "ما يحب لنفسه: من وجوه الخير والطاعة والمباحات."
      ],
      "benefits": [
        "سلامة الصدر من الغل والحسد من علامات الإيمان.",
        "المؤمن يسره ما يسر أخاه، ويحزنه ما يحزنه.",
        "الحث على التواضع والإيثار وحب الخير للناس."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الإيمان",
          "محبة الخير للآخرين",
          "الأخوة الإسلامية",
          "الإيثار"
        ],
        "english": [
          "Faith",
          "Wishing Good for Others",
          "Brotherhood",
          "Altruism"
        ],
        "category_arabic": "الأخوة الإسلامية",
        "category_english": "Islamic Brotherhood"
      },
      "arabic_narrator_intro": "عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه و سلم عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ\"",
      "arabic_plain": "عن أبي حمزة أنس بن مالك رضي الله عنه خادم رسول الله صلى الله عليه و سلم عن النبي صلى الله عليه و سلم قال: \"لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه\"",
      "arabic_hadith_text_plain": "\"لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه\"",
      "related_hadiths": [
        2,
        15,
        21,
        22
      ]
    },
    {
      "id": 40957,
      "idInBook": 14,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "حرمة دم المسلم",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ مَسْعُودٍ",
        "english": "Abdullah ibn Masud",
        "kunya_arabic": "أبو عبد الرحمن",
        "kunya_english": "Abu Abd al-Rahman",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ مَسْعُودٍ",
        "full_name_english": "Abdullah ibn Masud",
        "title_arabic": "فقيه الأمة",
        "title_english": "Jurist of the Ummah",
        "died_ah": 32,
        "died_ce": 652,
        "tribe_arabic": "هذيل",
        "tribe_english": "Hudhayl",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 848,
        "bio_arabic": "من السابقين الأولين إلى الإسلام، كان من أشد الناس معرفة بالقرآن وعلوم الدين.",
        "bio_english": "Among the first to embrace Islam, he was known as one of the most knowledgeable Companions in Quranic sciences and religious knowledge."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ  إلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ\".   \n \n،",
      "english": {
        "narrator": "On the authority of Ibn Masood (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “It is not permissible to spill the blood of a Muslim except in three : the married person who commits adultery, a life for a life, and the one who forsakes his religion and separates from the community.”\n\n\n"
      },
      "vocabulary": [
        "لا يحل دم: يحرم قتله.",
        "الثيب الزاني: المتزوج (أو من سبق له الزواج) إذا زنى.",
        "النفس بالنفس: القصاص (القاتل يقتل).",
        "المفارق للجماعة: المرتد الذي ترك الإسلام وخرج عن جماعة المسلمين."
      ],
      "benefits": [
        "الأصل في دم المسلم العصمة والتحريم.",
        "هذه الثلاث هي الجرائم العظمى التي توجب القتل حداً أو قصاصاً.",
        "التأكيد على خطورة الزنا بعد الإحصان، والقتل العمد، والردة."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "المحرمات",
          "الدم",
          "الردة",
          "الزنا",
          "القصاص",
          "العقوبات"
        ],
        "english": [
          "Prohibitions",
          "Blood",
          "Apostasy",
          "Adultery",
          "Retaliation",
          "Punishments"
        ],
        "category_arabic": "الفقه الجنائي",
        "category_english": "Criminal Jurisprudence"
      },
      "arabic_narrator_intro": "عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ\"",
      "arabic_plain": "عن ابن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم \"لا يحل دم امرئ مسلم  إلا بإحدى ثلاث: الثيب الزاني، والنفس بالنفس، والتارك لدينه المفارق للجماعة\".   \n \n،",
      "arabic_hadith_text_plain": "\"لا يحل دم امرئ مسلم إلا بإحدى ثلاث: الثيب الزاني، والنفس بالنفس، والتارك لدينه المفارق للجماعة\"",
      "related_hadiths": [
        8,
        33,
        30,
        32
      ]
    },
    {
      "id": 40958,
      "idInBook": 15,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "إكرام الضيف وآداب الكلام",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ\".   \n \n،",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:",
        "text": "Let him who believes in Allah and the Last Day speak good, or keep silent; and let him who believes in Allah and the Last Day be generous to his neighbour; and let him who believes in Allah and the Last Day be generous to his guest.\n\n\n"
      },
      "vocabulary": [
        "فليقل خيراً: كلاماً فيه نفع أو ذكر أو إصلاح.",
        "ليصمت: يمسك لسانه عن الشر واللغو.",
        "يكرم جاره: يحسن إليه ويكف الأذى عنه.",
        "يكرم ضيفه: يقدم له القرى (الطعام) ويحسن استقباله."
      ],
      "benefits": [
        "الترابط الوثيق بين الإيمان والسلوك الأخلاقي.",
        "خطر اللسان، وأن السلامة غالباً في الصمت إلا عن خير.",
        "حقوق الجوار والضيافة من شعب الإيمان العملية."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "حسن الجوار",
          "إكرام الضيف",
          "الصمت",
          "الكلام الطيب",
          "الإيمان"
        ],
        "english": [
          "Good Neighborliness",
          "Honoring Guests",
          "Silence",
          "Good Speech",
          "Faith"
        ],
        "category_arabic": "الأخلاق الاجتماعية",
        "category_english": "Social Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ\"",
      "arabic_plain": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه و سلم قال: \"من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت، ومن كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه\".   \n \n،",
      "arabic_hadith_text_plain": "\"من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت، ومن كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه\"",
      "related_hadiths": [
        2,
        13,
        21,
        22
      ]
    },
    {
      "id": 40959,
      "idInBook": 16,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "النهي عن الغضب",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري"
        ],
        "books_english": [
          "Sahih al-Bukhari"
        ],
        "grade_arabic": "رواه البخاري",
        "grade_english": "Narrated by Bukhari"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه و سلم أَوْصِنِي. قَالَ: لَا تَغْضَبْ، فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ\" .   \n ",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (may Allah be pleased with him):",
        "text": "A man said to the Prophet (peace and blessings of Allah be upon him), “Counsel me,” so he (peace and blessings of Allah be upon him) said, “Do not become angry.” The man repeated  he (peace and blessings of Allah be upon him) said, “Do not become angry.”\n\n"
      },
      "vocabulary": [
        "أوصني: اطلب منك نصيحة جامعة موجزة.",
        "لا تغضب: جاهد نفسك في عدم الانفعال، وإذا غضبت فلا تنفذ مقتضى غضبك."
      ],
      "benefits": [
        "الغضب مفتاح لكل شر، والسيطرة عليه مفتاح لكل خير.",
        "تكرار الوصية يدل على أهميتها وخطورة الغضب.",
        "الدواء النبوي للغضب: الاستعاذة، الوضوء، تغيير الهيئة، السكوت."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الغضب",
          "التحكم في النفس",
          "الحلم",
          "الصبر"
        ],
        "english": [
          "Anger",
          "Self-Control",
          "Forbearance",
          "Patience"
        ],
        "category_arabic": "الأخلاق",
        "category_english": "Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه و سلم أَوْصِنِي",
      "arabic_hadith_text": "قَالَ: لَا تَغْضَبْ، فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ",
      "arabic_plain": "عن أبي هريرة رضي الله عنه أن رجلا قال للنبي صلى الله عليه و سلم أوصني. قال: لا تغضب، فردد مرارا، قال: لا تغضب\" .   \n ",
      "arabic_hadith_text_plain": "قال: لا تغضب، فردد مرارا، قال: لا تغضب",
      "related_hadiths": [
        27,
        18,
        6
      ]
    },
    {
      "id": 40960,
      "idInBook": 17,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "وجوب الإحسان في كل شيء",
      "narrator": {
        "arabic": "شَدَّادُ بْنُ أَوْسٍ",
        "english": "Shaddad ibn Aws",
        "kunya_arabic": "أبو يعلى",
        "kunya_english": "Abu Ya'la",
        "full_name_arabic": "شَدَّادُ بْنُ أَوْسٍ الْأَنْصَارِيُّ",
        "full_name_english": "Shaddad ibn Aws al-Ansari",
        "title_arabic": "",
        "title_english": "",
        "died_ah": 58,
        "died_ce": 677,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 50,
        "bio_arabic": "صحابي جليل سكن بيت المقدس، وصفه النبي ﷺ بأنه من الفقهاء والحكماء.",
        "bio_english": "A distinguished Companion who settled in Jerusalem. The Prophet ﷺ described him as one of the jurists and wise men."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم",
          "سنن الترمذي",
          "سنن النسائي"
        ],
        "books_english": [
          "Sahih Muslim",
          "Jami al-Tirmidhi",
          "Sunan an-Nasai"
        ],
        "grade_arabic": "صحيح",
        "grade_english": "Sahih"
      },
      "arabic": "عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ: \"إنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ\". \n",
      "english": {
        "narrator": "On the authority of Abu Ya’la Shaddad bin Aws (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:",
        "text": "Verily Allah has prescribed ihsan (proficiency, perfection) in all things. So if you kill then kill well; and if you slaughter, then slaughter well. Let each one of you sharpen his blade and let him spare suffering to the animal he slaughters.”\n\n"
      },
      "vocabulary": [
        "كتب: قدر وأوجب وشرع.",
        "فأحسنوا القتلة: (بكسر القاف) الهيئة، أي لا تعذبوا من يُقتل بحق.",
        "ليحد شفرته: يسن سكينه حتى تكون قاطعة سريعة.",
        "ليرح ذبيحته: يعجل إزهاق روحها دون تعذيب."
      ],
      "benefits": [
        "قاعدة شاملة: الإحسان واجب ومطلوب في كل عمل (عبادة أو عادة).",
        "رحمة الإسلام شملت حتى الحيوان والبهائم.",
        "النهي عن التمثيل بالجثث أو تعذيب الحيوان عند ذبحه."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الإحسان",
          "الذبح",
          "القتل",
          "الرفق بالحيوان",
          "الرحمة"
        ],
        "english": [
          "Excellence",
          "Slaughter",
          "Killing",
          "Mercy to Animals",
          "Compassion"
        ],
        "category_arabic": "الأخلاق والفقه",
        "category_english": "Ethics & Jurisprudence"
      },
      "arabic_narrator_intro": "عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"إنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ\"",
      "arabic_plain": "عن أبي يعلى شداد بن أوس رضي الله عنه عن رسول الله صلى الله عليه و سلم قال: \"إن الله كتب الإحسان على كل شيء، فإذا قتلتم فأحسنوا القتلة، وإذا ذبحتم فأحسنوا الذبحة، وليحد أحدكم شفرته، وليرح ذبيحته\". \n",
      "arabic_hadith_text_plain": "\"إن الله كتب الإحسان على كل شيء، فإذا قتلتم فأحسنوا القتلة، وإذا ذبحتم فأحسنوا الذبحة، وليحد أحدكم شفرته، وليرح ذبيحته\"",
      "related_hadiths": [
        9,
        6,
        30,
        5
      ]
    },
    {
      "id": 40961,
      "idInBook": 18,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الخلق الحسن",
      "narrator": {
        "arabic": "أَبُو ذَرٍّ وَمُعَاذُ بْنُ جَبَلٍ",
        "english": "Abu Dharr and Muadh ibn Jabal",
        "kunya_arabic": "أبو ذر وأبو عبد الرحمن",
        "kunya_english": "Abu Dharr and Abu Abd al-Rahman",
        "full_name_arabic": "أَبُو ذَرٍّ الْغِفَارِيُّ وَمُعَاذُ بْنُ جَبَلٍ",
        "full_name_english": "Abu Dharr al-Ghifari and Muadh ibn Jabal",
        "title_arabic": "صحابيان جليلان",
        "title_english": "Two Distinguished Companions",
        "died_ah": "32 هـ (أبو ذر) | 18 هـ (معاذ)",
        "died_ce": "652 (أبو ذر) | 639 (معاذ)",
        "tribe_arabic": "غفار والخزرج",
        "tribe_english": "Ghifar and Khazraj",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": "281 (أبو ذر) + 157 (معاذ)",
        "bio_arabic": "حديث روي عن صحابيين جليلين: أبو ذر الغفاري ومعاذ بن جبل رضي الله عنهما.",
        "bio_english": "Hadith narrated from two distinguished Companions: Abu Dharr al-Ghifari and Muadh ibn Jabal."
      },
      "source": {
        "books_arabic": [
          "سنن الترمذي",
          "مسند أحمد"
        ],
        "books_english": [
          "Jami al-Tirmidhi",
          "Musnad Ahmad"
        ],
        "grade_arabic": "حسن صحيح",
        "grade_english": "Hasan Sahih"
      },
      "arabic": "عَنْ أَبِي ذَرٍّ جُنْدَبِ بْنِ جُنَادَةَ، وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ: \"اتَّقِ اللَّهَ حَيْثُمَا كُنْت، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ\" ",
      "english": {
        "narrator": "On the authority of Abu Dharr Jundub ibn Junadah, and Abu Abdur-Rahman Muadh bin Jabal (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:",
        "text": "Have taqwa (fear) of Allah wherever you may be, and follow up a bad deed with a good deed which will wipe it out, and behave well towards the people.\n\nIt was related by at-Tirmidhi, who said it was a hasan (good) hadeeth, and in some copies it is stated to be a hasan saheeh hadeeth."
      },
      "vocabulary": [
        "اتق الله: خف الله وراقبه بامتثال أوامره واجتناب نواهيه.",
        "حيثما كنت: في السر والعلن، في الخلوة والجلوة.",
        "أتبع السيئة الحسنة: إذا أذنبت فافعل طاعة فوراً (كالتوبة والاستغفار).",
        "تمحها: تزيل إثمها وأثرها."
      ],
      "benefits": [
        "مراقبة الله في كل مكان وزمان.",
        "الحسنات (خاصة التوبة) تكفر السيئات.",
        "كمال المؤمن في: تقوى الله (علاقة مع الخالق) وحسن الخلق (علاقة مع المخلوق)."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "تقوى الله",
          "الحسنة تمحو السيئة",
          "حسن الخلق",
          "التوبة"
        ],
        "english": [
          "Fear of Allah",
          "Good Deeds Erase Bad",
          "Good Character",
          "Repentance"
        ],
        "category_arabic": "الأخلاق والتوبة",
        "category_english": "Ethics & Repentance"
      },
      "arabic_narrator_intro": "عَنْ أَبِي ذَرٍّ جُنْدَبِ بْنِ جُنَادَةَ، وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"اتَّقِ اللَّهَ حَيْثُمَا كُنْت، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ\"",
      "arabic_plain": "عن أبي ذر جندب بن جنادة، وأبي عبد الرحمن معاذ بن جبل رضي الله عنهما، عن رسول الله صلى الله عليه و سلم قال: \"اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن\" ",
      "arabic_hadith_text_plain": "\"اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن\"",
      "related_hadiths": [
        1,
        42,
        6,
        27
      ]
    },
    {
      "id": 40962,
      "idInBook": 19,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الاستعانة بالله وحفظه",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "english": "Abdullah ibn Abbas",
        "kunya_arabic": "أبو العباس",
        "kunya_english": "Abu al-Abbas",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "full_name_english": "Abdullah ibn Abbas",
        "title_arabic": "حبر الأمة، ترجمان القرآن",
        "title_english": "Scholar of the Ummah, Interpreter of the Quran",
        "died_ah": 68,
        "died_ce": 687,
        "tribe_arabic": "قريش - بنو هاشم",
        "tribe_english": "Quraysh - Banu Hashim",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 1660,
        "bio_arabic": "ابن عم النبي ﷺ، دعا له النبي بالفقه في الدين، يُعدّ من أعلم الصحابة بالتفسير والفقه.",
        "bio_english": "Cousin of the Prophet ﷺ, for whom the Prophet supplicated for deep understanding of religion. Considered the most knowledgeable Companion in Quranic interpretation."
      },
      "source": {
        "books_arabic": [
          "سنن الترمذي"
        ],
        "books_english": [
          "Jami al-Tirmidhi"
        ],
        "grade_arabic": "حسن صحيح",
        "grade_english": "Hasan Sahih"
      },
      "arabic": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: \"كُنْت خَلْفَ رَسُولِ اللَّهِ صلى الله عليه و سلم يَوْمًا، فَقَالَ: يَا غُلَامِ! إنِّي أُعَلِّمُك كَلِمَاتٍ: احْفَظْ اللَّهَ يَحْفَظْك، احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَك، إذَا سَأَلْت فَاسْأَلْ اللَّهَ، وَإِذَا اسْتَعَنْت فَاسْتَعِنْ بِاَللَّهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوك بِشَيْءٍ لَمْ يَنْفَعُوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَك، وَإِنْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوك بِشَيْءٍ لَمْ يَضُرُّوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْك؛ رُفِعَتْ الْأَقْلَامُ، وَجَفَّتْ الصُّحُفُ\" ",
      "english": {
        "narrator": "On the authority of Abu Abbas Abdullah bin Abbas (may Allah be pleased with him) who said:",
        "text": "One day I was behind the Prophet (peace and blessings of Allah be upon him) . And know that if the nation were to gather together to benefit you with anything, they would not benefit you except with what Allah had already prescribed for you. And if they were to gather together to harm you with anything, they would not harm you except with what Allah had already prescribed against you. The pens have been lifted and the pages have dried.”\n\nIt was related by at-Tirmidhi, who said it was a good and sound hadeeth. Another narration, other than that of Tirmidhi, reads:\n\nBe mindful of Allah, and you will find Him in front of you. Recognize and acknowledge Allah in times of ease and prosperity, and He will remember you in times of adversity. And know that what has passed you by  was not going to befall you, and what has befallen you was not going to pass you by. And know that victory comes with patience, relief with affliction, and hardship with ease."
      },
      "vocabulary": [
        "يا غلام: نداء تلطف، وكان ابن عباس صغيراً.",
        "احفظ الله: احفظ شرعه بعدم تجاوزه.",
        "تجاهك: أمامك، تجده معك في الشدائد.",
        "رفعت الأقلام وجفت الصحف: كناية عن أن المقادير كتبت وانتهى الأمر، فلا تبديل لها."
      ],
      "benefits": [
        "الاهتمام بتربية النشأة وتعليمهم العقيدة الصحيحة.",
        "الجزاء من جنس العمل: من حفظ الله بالطاعة حفظه الله بالرعاية.",
        "التوحيد الخالص: لا نافع ولا ضار إلا الله، والخلق أسباب.",
        "الرضا بالقدر واليقين بأن ما أصابك لم يكن ليخطئك."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "التوكل على الله",
          "حفظ الله",
          "القدر",
          "الاستعانة بالله"
        ],
        "english": [
          "Reliance on Allah",
          "Allah's Protection",
          "Destiny",
          "Seeking Allah's Help"
        ],
        "category_arabic": "التوكل والعقيدة",
        "category_english": "Reliance & Creed"
      },
      "arabic_narrator_intro": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ",
      "arabic_hadith_text": "\"كُنْت خَلْفَ رَسُولِ اللَّهِ صلى الله عليه و سلم يَوْمًا، فَقَالَ: يَا غُلَامِ! إنِّي أُعَلِّمُك كَلِمَاتٍ: احْفَظْ اللَّهَ يَحْفَظْك، احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَك، إذَا سَأَلْت فَاسْأَلْ اللَّهَ، وَإِذَا اسْتَعَنْت فَاسْتَعِنْ بِاَللَّهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوك بِشَيْءٍ لَمْ يَنْفَعُوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَك، وَإِنْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوك بِشَيْءٍ لَمْ يَضُرُّوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْك؛ رُفِعَتْ الْأَقْلَامُ، وَجَفَّتْ الصُّحُفُ\"",
      "arabic_plain": "عن عبد الله بن عباس رضي الله عنهما قال: \"كنت خلف رسول الله صلى الله عليه و سلم يوما، فقال: يا غلام! إني أعلمك كلمات: احفظ الله يحفظك، احفظ الله تجده تجاهك، إذا سألت فاسأل الله، وإذا استعنت فاستعن بالله، واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك، وإن اجتمعوا على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك؛ رفعت الأقلام، وجفت الصحف\" ",
      "arabic_hadith_text_plain": "\"كنت خلف رسول الله صلى الله عليه و سلم يوما، فقال: يا غلام! إني أعلمك كلمات: احفظ الله يحفظك، احفظ الله تجده تجاهك، إذا سألت فاسأل الله، وإذا استعنت فاستعن بالله، واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك، وإن اجتمعوا على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك؛ رفعت الأقلام، وجفت الصحف\"",
      "related_hadiths": [
        2,
        4,
        37
      ]
    },
    {
      "id": 40963,
      "idInBook": 20,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الحياء من الإيمان",
      "narrator": {
        "arabic": "عُقْبَةُ بْنُ عَمْرٍو الْأَنْصَارِيُّ",
        "english": "Uqbah ibn Amr al-Ansari",
        "kunya_arabic": "أبو مسعود",
        "kunya_english": "Abu Masood",
        "full_name_arabic": "عُقْبَةُ بْنُ عَمْرٍو الْأَنْصَارِيُّ",
        "full_name_english": "Uqbah ibn Amr al-Ansari",
        "title_arabic": "البدري",
        "title_english": "al-Badri (of Badr)",
        "died_ah": 40,
        "died_ce": 660,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 102,
        "bio_arabic": "صحابي أنصاري نسب إلى بدر لسكنه قريباً منها، ولي الكوفة في عهد علي رضي الله عنه.",
        "bio_english": "An Ansari Companion attributed to Badr due to his residence nearby. Governed Kufa during Ali's caliphate."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو الْأَنْصَارِيِّ الْبَدْرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"إنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْت\" . \n ",
      "english": {
        "narrator": "On the authority of Abu Masood Uqbah bin ’Amr al-Ansaree al-Badree (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “Verily, from what was learnt by the people from the speech of the earliest prophecy is: If you feel no shame, then do as you wish.”\n\n"
      },
      "vocabulary": [
        "النبوة الأولى: ما نُقل عن الأنبياء السابقين وبقي متداولاً.",
        "لم تستح: فقدت الحياء الذي يمنع من القبيح.",
        "فاصنع ما شئت: أمر بمعنى التهديد والوعيد، أو بمعنى الخبر (من لا حياء له يفعل أي شيء)."
      ],
      "benefits": [
        "الحياء هو الذي يضبط سلوك الإنسان ويمنعه من الرذائل.",
        "اتفاق الشرائع والأنبياء جميعاً على مدح الحياء.",
        "إذا ذهب الحياء من الوجه، هان على الإنسان فعل المعاصي والقبائح."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الحياء",
          "الأخلاق",
          "السنة",
          "فعل الخير"
        ],
        "english": [
          "Modesty",
          "Ethics",
          "Sunnah",
          "Doing Good"
        ],
        "category_arabic": "الأخلاق",
        "category_english": "Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو الْأَنْصَارِيِّ الْبَدْرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"إنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْت\"",
      "arabic_plain": "عن أبي مسعود عقبة بن عمرو الأنصاري البدري رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم \"إن مما أدرك الناس من كلام النبوة الأولى: إذا لم تستح فاصنع ما شئت\" . \n ",
      "arabic_hadith_text_plain": "\"إن مما أدرك الناس من كلام النبوة الأولى: إذا لم تستح فاصنع ما شئت\"",
      "related_hadiths": [
        5,
        28
      ]
    },
    {
      "id": 40964,
      "idInBook": 21,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الاستقامة في الإسلام",
      "narrator": {
        "arabic": "سُفْيَانُ بْنُ عَبْدِ اللَّهِ الثَّقَفِيُّ",
        "english": "Sufyan ibn Abdullah al-Thaqafi",
        "kunya_arabic": "أبو عمرو",
        "kunya_english": "Abu Amr",
        "full_name_arabic": "سُفْيَانُ بْنُ عَبْدِ اللَّهِ الثَّقَفِيُّ",
        "full_name_english": "Sufyan ibn Abdullah al-Thaqafi",
        "title_arabic": "",
        "title_english": "",
        "died_ah": "غير محدد",
        "died_ce": "Unknown",
        "tribe_arabic": "ثقيف",
        "tribe_english": "Thaqif",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5,
        "bio_arabic": "صحابي من ثقيف، روى أحاديث قليلة لكنها جامعة لأصول عظيمة من الدين.",
        "bio_english": "A Companion from the Thaqif tribe. Narrated few hadiths but they contain great foundational principles of religion."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي عَمْرٍو وَقِيلَ: أَبِي عَمْرَةَ سُفْيَانَ بْنِ عَبْدِ اللَّهِ رَضِيَ اللهُ عَنْهُ قَالَ: \"قُلْت: يَا رَسُولَ اللَّهِ! قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَك؛ قَالَ: قُلْ: آمَنْت بِاَللَّهِ ثُمَّ اسْتَقِمْ\" . \n",
      "english": {
        "narrator": "On the authority of Abu `Amr — and he is also called Abu `Amrah — Sufyan bin Abdullah ath- Thaqafee (may Allah be pleased with him) who said:",
        "text": "I said, \"O Messenger of Allah, tell me something about al-Islam which I can ask of no one but you.\" He (peace and blessings of Allah be upon him) said, \"Say I believe in Allah — and then be steadfast.\"\n\n"
      },
      "vocabulary": [
        "قولاً: كلاماً جامعاً كافياً.",
        "آمنت بالله: جدد إيمانك بالقلب واللسان.",
        "استقم: داوم على طاعة الله ولا تحِد عنها حتى الممات."
      ],
      "benefits": [
        "جمع هذا الحديث الدين كله في كلمتين: الإيمان والاستقامة.",
        "الاستقامة أصعب الدرجات، وتتطلب مجاهدة مستمرة.",
        "حرص الصحابة على السؤال عما ينفعهم في دينهم بكلمات موجزة."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الاستقامة",
          "الإيمان",
          "التوحيد",
          "الثبات على الدين"
        ],
        "english": [
          "Uprightness",
          "Faith",
          "Monotheism",
          "Steadfastness"
        ],
        "category_arabic": "الاستقامة",
        "category_english": "Uprightness"
      },
      "arabic_narrator_intro": "عَنْ أَبِي عَمْرٍو وَقِيلَ: أَبِي عَمْرَةَ سُفْيَانَ بْنِ عَبْدِ اللَّهِ رَضِيَ اللهُ عَنْهُ قَالَ",
      "arabic_hadith_text": "\"قُلْت: يَا رَسُولَ اللَّهِ! قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَك؛ قَالَ: قُلْ: آمَنْت بِاَللَّهِ ثُمَّ اسْتَقِمْ\"",
      "arabic_plain": "عن أبي عمرو وقيل: أبي عمرة سفيان بن عبد الله رضي الله عنه قال: \"قلت: يا رسول الله! قل لي في الإسلام قولا لا أسأل عنه أحدا غيرك؛ قال: قل: آمنت بالله ثم استقم\" . \n",
      "arabic_hadith_text_plain": "\"قلت: يا رسول الله! قل لي في الإسلام قولا لا أسأل عنه أحدا غيرك؛ قال: قل: آمنت بالله ثم استقم\"",
      "related_hadiths": [
        2,
        13,
        15,
        22
      ]
    },
    {
      "id": 40965,
      "idInBook": 22,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "طريق الجنة",
      "narrator": {
        "arabic": "جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ",
        "english": "Jabir ibn Abdullah al-Ansari",
        "kunya_arabic": "أبو عبد الله",
        "kunya_english": "Abu Abdullah",
        "full_name_arabic": "جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ",
        "full_name_english": "Jabir ibn Abdullah al-Ansari",
        "title_arabic": "مفتي المدينة",
        "title_english": "Mufti of Madinah",
        "died_ah": 78,
        "died_ce": 697,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 1540,
        "bio_arabic": "من أكثر الصحابة رواية للحديث، شهد بيعة العقبة الثانية وغزوات كثيرة مع النبي ﷺ.",
        "bio_english": "One of the most prolific narrators among the Companions. Witnessed the Second Pledge of Aqabah and many battles with the Prophet ﷺ."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي عَبْدِ اللَّهِ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ رَضِيَ اللَّهُ عَنْهُمَا: \"أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صلى الله عليه و سلم فَقَالَ: أَرَأَيْت إذَا صَلَّيْت الْمَكْتُوبَاتِ، وَصُمْت رَمَضَانَ، وَأَحْلَلْت الْحَلَالَ، وَحَرَّمْت الْحَرَامَ، وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا؛ أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: نَعَمْ\". \n",
      "english": {
        "narrator": "On the authority of Abu Abdullah Jabir bin Abdullah al-Ansaree (may Allah be pleased with him) that:",
        "text": "A man questioned the Messenger of Allah (peace and blessings of Allah be upon him) and said, “Do you think that if I perform the obligatory prayers, fast in Ramadhan, treat as lawful that which is halal, and treat as forbidden that which is haram, and do not increase upon that , then I shall enter Paradise?” He (peace and blessings of Allah be upon him) replied, “Yes.”\n\n"
      },
      "vocabulary": [
        "أرأيت: أخبرني.",
        "المكتوبات: الصلوات الخمس المفروضة.",
        "أحللت الحلال: اعتقدت حله وفعلته.",
        "حرمت الحرام: اعتقدت حرمته واجتنبته.",
        "لم أزد على ذلك: لم أتطوع بالنوافل."
      ],
      "benefits": [
        "المحافظة على الفرائض واجتناب المحرمات سبب كافٍ لدخول الجنة.",
        "تيسير الإسلام وعدم تكليف الناس بما لا يطيقون.",
        "أهمية اقتران العمل بالاعتقاد (التحليل والتحريم بالقلب)."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "يوم القيامة",
          "الصراط المستقيم",
          "الجنة",
          "الإيمان"
        ],
        "english": [
          "Day of Judgment",
          "Straight Path",
          "Paradise",
          "Faith"
        ],
        "category_arabic": "العقيدة",
        "category_english": "Creed"
      },
      "arabic_narrator_intro": "عَنْ أَبِي عَبْدِ اللَّهِ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ رَضِيَ اللَّهُ عَنْهُمَا",
      "arabic_hadith_text": "\"أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صلى الله عليه و سلم فَقَالَ: أَرَأَيْت إذَا صَلَّيْت الْمَكْتُوبَاتِ، وَصُمْت رَمَضَانَ، وَأَحْلَلْت الْحَلَالَ، وَحَرَّمْت الْحَرَامَ، وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا؛ أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: نَعَمْ\"",
      "arabic_plain": "عن أبي عبد الله جابر بن عبد الله الأنصاري رضي الله عنهما: \"أن رجلا سأل رسول الله صلى الله عليه و سلم فقال: أرأيت إذا صليت المكتوبات، وصمت رمضان، وأحللت الحلال، وحرمت الحرام، ولم أزد على ذلك شيئا؛ أأدخل الجنة؟ قال: نعم\". \n",
      "arabic_hadith_text_plain": "\"أن رجلا سأل رسول الله صلى الله عليه و سلم فقال: أرأيت إذا صليت المكتوبات، وصمت رمضان، وأحللت الحلال، وحرمت الحرام، ولم أزد على ذلك شيئا؛ أأدخل الجنة؟ قال: نعم\"",
      "related_hadiths": [
        2,
        13,
        15,
        21
      ]
    },
    {
      "id": 40966,
      "idInBook": 23,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "جوامع الخير (الطهور شطر الإيمان)",
      "narrator": {
        "arabic": "الْحَارِثُ بْنُ عَاصِمٍ الْأَشْعَرِيُّ",
        "english": "al-Harith ibn Asim al-Ash'ari",
        "kunya_arabic": "أبو مالك",
        "kunya_english": "Abu Malik",
        "full_name_arabic": "الْحَارِثُ بْنُ عَاصِمٍ الْأَشْعَرِيُّ",
        "full_name_english": "al-Harith ibn Asim al-Ash'ari",
        "title_arabic": "",
        "title_english": "",
        "died_ah": "غير محدد",
        "died_ce": "Unknown",
        "tribe_arabic": "الأشعريون",
        "tribe_english": "Ash'ariyun",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 7,
        "bio_arabic": "صحابي أشعري، روى هذا الحديث الجامع في فضل الطهارة والأعمال الصالحة.",
        "bio_english": "An Ash'ari Companion who narrated this comprehensive hadith on the virtues of purity and righteous deeds."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي مَالِكٍ الْحَارِثِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"الطَّهُورُ شَطْرُ الْإِيمَانِ، وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ، وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآنِ -أَوْ: تَمْلَأُ- مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالصَّلَاةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَك أَوْ عَلَيْك، كُلُّ النَّاسِ يَغْدُو، فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا\". \n",
      "english": {
        "narrator": "On the authority of Abu Malik al-Harith bin Asim al-Asharee (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “Purity is half of iman (faith). ‘Al-hamdu lillah (praise be to Allah)’ fills the scales, and ‘subhan-Allah (how far is Allah from every imperfection) and ‘Al-hamdulillah (praise be to Allah)’ fill that which is between heaven and earth. And the salah (prayer) is a light, and charity is a proof, and patience is illumination, and the Qur’an is a proof either for you or against you. Every person starts his day as a vendor of his soul, either freeing it or causing its ruin.”\n\n"
      },
      "vocabulary": [
        "الطهور: (بضم الطاء) فعل التطهر والوضوء.",
        "شطر الإيمان: نصف الإيمان (لأن الإيمان تخلية وتحلية، والطهور تخلية من الذنوب والأقذار).",
        "برهان: دليل ساطع على صدق إيمان المتصدق (لأن النفس تحب المال).",
        "حجة لك: يشهد لك إن عملت به.",
        "موبقها: مهلكها بالمعاصي."
      ],
      "benefits": [
        "عظم مكانة الوضوء والطهارة.",
        "فضل التسبيح والتحميد وأنهما يملآن الموازين.",
        "القرآن إما شافع لصاحبه أو شاهد عليه يوم القيامة.",
        "كل إنسان يسعى، فإما أن يحرر نفسه بالطاعة أو يهلكها بالمعصية."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الطهارة",
          "الصلاة",
          "الذكر",
          "فضل العبادة",
          "الصدقة"
        ],
        "english": [
          "Purity",
          "Prayer",
          "Remembrance of Allah",
          "Virtue of Worship",
          "Charity"
        ],
        "category_arabic": "العبادات",
        "category_english": "Acts of Worship"
      },
      "arabic_narrator_intro": "عَنْ أَبِي مَالِكٍ الْحَارِثِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"الطَّهُورُ شَطْرُ الْإِيمَانِ، وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ، وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآنِ -أَوْ: تَمْلَأُ- مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالصَّلَاةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَك أَوْ عَلَيْك، كُلُّ النَّاسِ يَغْدُو، فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا\"",
      "arabic_plain": "عن أبي مالك الحارث بن عاصم الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم \"الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن -أو: تملأ- ما بين السماء والأرض، والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك، كل الناس يغدو، فبائع نفسه فمعتقها أو موبقها\". \n",
      "arabic_hadith_text_plain": "\"الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن -أو: تملأ- ما بين السماء والأرض، والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك، كل الناس يغدو، فبائع نفسه فمعتقها أو موبقها\"",
      "related_hadiths": [
        25,
        29,
        3,
        8
      ]
    },
    {
      "id": 40967,
      "idInBook": 24,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "تحريم الظلم (حديث قدسي)",
      "narrator": {
        "arabic": "أَبُو ذَرٍّ الْغِفَارِيُّ",
        "english": "Abu Dharr al-Ghifari",
        "kunya_arabic": "أبو ذر",
        "kunya_english": "Abu Dharr",
        "full_name_arabic": "جُنْدَبُ بْنُ جُنَادَةَ الْغِفَارِيُّ",
        "full_name_english": "Jundub ibn Junadah al-Ghifari",
        "title_arabic": "الصادق الزاهد",
        "title_english": "The Truthful Ascetic",
        "died_ah": 32,
        "died_ce": 652,
        "tribe_arabic": "غفار",
        "tribe_english": "Ghifar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 281,
        "bio_arabic": "من السابقين الأولين إلى الإسلام، مشهور بزهده وشدة صدقه، أوصاه النبي ﷺ بوصايا عظيمة.",
        "bio_english": "Among the earliest converts to Islam, known for his asceticism and extreme truthfulness. The Prophet ﷺ gave him great counsel."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم (قدسي)",
        "grade_english": "Narrated by Muslim (Qudsi)"
      },
      "arabic": "عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، أَنَّهُ قَالَ: \"يَا عِبَادِي: إنِّي حَرَّمْت الظُّلْمَ عَلَى نَفْسِي، وَجَعَلْته بَيْنَكُمْ مُحَرَّمًا؛ فَلَا تَظَالَمُوا. يَا عِبَادِي! كُلُّكُمْ ضَالٌّ إلَّا مَنْ هَدَيْته، فَاسْتَهْدُونِي أَهْدِكُمْ. يَا عِبَادِي! كُلُّكُمْ جَائِعٌ إلَّا مَنْ أَطْعَمْته، فَاسْتَطْعِمُونِي أُطْعِمْكُمْ. يَا عِبَادِي! كُلُّكُمْ عَارٍ إلَّا مَنْ كَسَوْته، فَاسْتَكْسُونِي أَكْسُكُمْ. يَا عِبَادِي! إنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا؛ فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ. يَا عِبَادِي! إنَّكُمْ لَنْ تَبْلُغُوا ضُرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ، فَسَأَلُونِي، فَأَعْطَيْت كُلَّ وَاحِدٍ مَسْأَلَته، مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إذَا أُدْخِلَ الْبَحْرَ. يَا عِبَادِي! إنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إيَّاهَا؛ فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَن إلَّا نَفْسَهُ\". \n",
      "english": {
        "narrator": "On the authority of Abu Dharr al-Ghifaree (may Allah be pleased with him) from the Prophet (peace and blessings of Allah be upon him) from his Lord, that He said:",
        "text": "O My servants! I have forbidden dhulm (oppression) for Myself, and I have made it forbidden amongst you, so do not oppress one another.\n\n\nO My servants, all of you are astray except those whom I have guided, so seek guidance from Me and I shall guide you.\n\n\nO My servants, all of you are hungry except those whom I have fed, so seek food from Me and I shall feed you.\n\n\nO My servants, all of you are naked except those whom I have clothed, so seek clothing from Me and I shall clothe you.\n\n\nO My servants, you commit sins by day and by night, and I forgive all sins, so seek forgiveness from Me and I shall forgive you.\n\n\nO My servants, you will not attain harming Me so as to harm Me, and you will not attain benefiting Me so as to benefit Me.\n\n\nO My servants, if the first of you and the last of you, and the humans of you and the jinn of you, were all as pious as the most pious heart of any individual amongst you, then this would not increase My Kingdom an iota.\n\n\nO My servants, if the first of you and the last of you, and the humans of you and the jinn of you, were all as wicked as the most wicked heart of any individual amongst you, then this would not decrease My Kingdom an iota.\n\n\nO My servants, if the first of you and the last of you, and the humans of you and the jinn of you, were all to stand together in one place and ask of Me, and I were to give everyone what he requested, then that would not decrease what I Possess, except what is decreased of the ocean when a needle is dipped into it.\n\n\nO My servants, it is but your deeds that I account for you, and then recompense you for. So he who finds good, let him praise Allah, and he who finds other than that, let him blame no one but himself.\n\n\n"
      },
      "vocabulary": [
        "حرمت الظلم على نفسي: تقدس عنه سبحانه لكمال عدله.",
        "لا تظالموا: لا يظلم بعضكم بعضاً.",
        "ضال: تائه عن الحق.",
        "صعيد واحد: أرض واحدة ومقام واحد.",
        "المخيط: الإبرة.",
        "أحصيها لكم: أضبطها وأكتبها ولا يضيع منها شيء."
      ],
      "benefits": [
        "تحريم الظلم تحريماً قاطعاً، سواء ظلم النفس أو العباد.",
        "افتقار الخلق جميعاً إلى الله في الهداية والرزق.",
        "غنى الله المطلق عن طاعة الطائعين، وعدم تضرره بمعصية العاصين.",
        "خزائن الله ملأى لا تنفد بالعطاء."
      ],
      "hadith_type": {
        "type": "qudsi",
        "arabic": "حديث قدسي",
        "english": "Hadith Qudsi (Divine Hadith)"
      },
      "topics": {
        "arabic": [
          "العدل",
          "الظلم",
          "التحريم",
          "أسماء الله",
          "القدسي"
        ],
        "english": [
          "Justice",
          "Oppression",
          "Prohibition",
          "Names of Allah",
          "Qudsi"
        ],
        "category_arabic": "العقيدة والأخلاق",
        "category_english": "Creed & Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، أَنَّهُ قَالَ",
      "arabic_hadith_text": "\"يَا عِبَادِي: إنِّي حَرَّمْت الظُّلْمَ عَلَى نَفْسِي، وَجَعَلْته بَيْنَكُمْ مُحَرَّمًا؛ فَلَا تَظَالَمُوا. يَا عِبَادِي! كُلُّكُمْ ضَالٌّ إلَّا مَنْ هَدَيْته، فَاسْتَهْدُونِي أَهْدِكُمْ. يَا عِبَادِي! كُلُّكُمْ جَائِعٌ إلَّا مَنْ أَطْعَمْته، فَاسْتَطْعِمُونِي أُطْعِمْكُمْ. يَا عِبَادِي! كُلُّكُمْ عَارٍ إلَّا مَنْ كَسَوْته، فَاسْتَكْسُونِي أَكْسُكُمْ. يَا عِبَادِي! إنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا؛ فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ. يَا عِبَادِي! إنَّكُمْ لَنْ تَبْلُغُوا ضُرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ، فَسَأَلُونِي، فَأَعْطَيْت كُلَّ وَاحِدٍ مَسْأَلَته، مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إذَا أُدْخِلَ الْبَحْرَ. يَا عِبَادِي! إنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إيَّاهَا؛ فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَن إلَّا نَفْسَهُ\"",
      "arabic_plain": "عن أبي ذر الغفاري رضي الله عنه عن النبي صلى الله عليه و سلم فيما يرويه عن ربه تبارك وتعالى، أنه قال: \"يا عبادي: إني حرمت الظلم على نفسي، وجعلته بينكم محرما؛ فلا تظالموا. يا عبادي! كلكم ضال إلا من هديته، فاستهدوني أهدكم. يا عبادي! كلكم جائع إلا من أطعمته، فاستطعموني أطعمكم. يا عبادي! كلكم عار إلا من كسوته، فاستكسوني أكسكم. يا عبادي! إنكم تخطئون بالليل والنهار، وأنا أغفر الذنوب جميعا؛ فاستغفروني أغفر لكم. يا عبادي! إنكم لن تبلغوا ضري فتضروني، ولن تبلغوا نفعي فتنفعوني. يا عبادي! لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم، ما زاد ذلك في ملكي شيئا. يا عبادي! لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد منكم، ما نقص ذلك من ملكي شيئا. يا عبادي! لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد، فسألوني، فأعطيت كل واحد مسألته، ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر. يا عبادي! إنما هي أعمالكم أحصيها لكم، ثم أوفيكم إياها؛ فمن وجد خيرا فليحمد الله، ومن وجد غير ذلك فلا يلومن إلا نفسه\". \n",
      "arabic_hadith_text_plain": "\"يا عبادي: إني حرمت الظلم على نفسي، وجعلته بينكم محرما؛ فلا تظالموا. يا عبادي! كلكم ضال إلا من هديته، فاستهدوني أهدكم. يا عبادي! كلكم جائع إلا من أطعمته، فاستطعموني أطعمكم. يا عبادي! كلكم عار إلا من كسوته، فاستكسوني أكسكم. يا عبادي! إنكم تخطئون بالليل والنهار، وأنا أغفر الذنوب جميعا؛ فاستغفروني أغفر لكم. يا عبادي! إنكم لن تبلغوا ضري فتضروني، ولن تبلغوا نفعي فتنفعوني. يا عبادي! لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم، ما زاد ذلك في ملكي شيئا. يا عبادي! لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد منكم، ما نقص ذلك من ملكي شيئا. يا عبادي! لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد، فسألوني، فأعطيت كل واحد مسألته، ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر. يا عبادي! إنما هي أعمالكم أحصيها لكم، ثم أوفيكم إياها؛ فمن وجد خيرا فليحمد الله، ومن وجد غير ذلك فلا يلومن إلا نفسه\"",
      "related_hadiths": [
        38,
        37,
        42
      ]
    },
    {
      "id": 40968,
      "idInBook": 25,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "فضل الذكر وصدقة الأعضاء",
      "narrator": {
        "arabic": "أَبُو ذَرٍّ الْغِفَارِيُّ",
        "english": "Abu Dharr al-Ghifari",
        "kunya_arabic": "أبو ذر",
        "kunya_english": "Abu Dharr",
        "full_name_arabic": "جُنْدَبُ بْنُ جُنَادَةَ الْغِفَارِيُّ",
        "full_name_english": "Jundub ibn Junadah al-Ghifari",
        "title_arabic": "الصادق الزاهد",
        "title_english": "The Truthful Ascetic",
        "died_ah": 32,
        "died_ce": 652,
        "tribe_arabic": "غفار",
        "tribe_english": "Ghifar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 281,
        "bio_arabic": "من السابقين الأولين إلى الإسلام، مشهور بزهده وشدة صدقه، أوصاه النبي ﷺ بوصايا عظيمة.",
        "bio_english": "Among the earliest converts to Islam, known for his asceticism and extreme truthfulness. The Prophet ﷺ gave him great counsel."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي ذَرٍّ رَضِيَ اللهُ عَنْهُ أَيْضًا، \"أَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالُوا لِلنَّبِيِّ صلى الله عليه و سلم يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالْأُجُورِ؛ يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ، وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ. قَالَ: أَوَلَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ؟ إنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً، وَكُلِّ تَكْبِيرَةٍ صَدَقَةً، وَكُلِّ تَحْمِيدَةٍ صَدَقَةً، وَكُلِّ تَهْلِيلَةٍ صَدَقَةً، وَأَمْرٌ بِمَعْرُوفٍ صَدَقَةٌ، وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ، وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ. قَالُوا: يَا رَسُولَ اللَّهِ أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إذَا وَضَعَهَا فِي الْحَلَالِ، كَانَ لَهُ أَجْرٌ\". \n",
      "english": {
        "narrator": "Also on the authority of Abu Dharr (may Allah be pleased with him):",
        "text": "Some people from amongst the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) said to the Prophet (peace and blessings of Allah be upon him), \"O Messenger of Allah, the affluent have made off with the rewards; they pray as we pray, they fast as we fast, and they give  of each one of you there is a charity.\"\n\nThey said, \"O Messenger of Allah, when one of us fulfils his carnal desire will he have some reward for that?\" He (peace and blessings of Allah be upon him) said, \"Do you not see that if he were to act upon it  in an unlawful manner then he would be deserving of punishment? Likewise, if he were to act upon it in a lawful manner then he will be deserving of a reward.\"\n\n"
      },
      "vocabulary": [
        "أهل الدثور: أصحاب الأموال الكثيرة.",
        "بضع أحدكم: الجماع (إتيان الأهل بالحلال).",
        "وزر: إثم وعقوبة."
      ],
      "benefits": [
        "حرص الصحابة (الفقراء) على السبق في الآخرة لا في الدنيا.",
        "مفهوم الصدقة واسع يشمل كل أنواع المعروف والذكر.",
        "احتساب النية في المباحات (كالنوم والأكل والجماع) يحولها إلى عبادات يؤجر عليها العبد."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الصدقة",
          "التطوع",
          "الصلاة",
          "الصوم",
          "الذكر"
        ],
        "english": [
          "Charity",
          "Voluntary Acts",
          "Prayer",
          "Fasting",
          "Remembrance"
        ],
        "category_arabic": "العبادات التطوعية",
        "category_english": "Voluntary Worship"
      },
      "arabic_narrator_intro": "عَنْ أَبِي ذَرٍّ رَضِيَ اللهُ عَنْهُ أَيْضًا",
      "arabic_hadith_text": "\"أَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالُوا لِلنَّبِيِّ صلى الله عليه و سلم يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالْأُجُورِ؛ يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ، وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ. قَالَ: أَوَلَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ؟ إنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً، وَكُلِّ تَكْبِيرَةٍ صَدَقَةً، وَكُلِّ تَحْمِيدَةٍ صَدَقَةً، وَكُلِّ تَهْلِيلَةٍ صَدَقَةً، وَأَمْرٌ بِمَعْرُوفٍ صَدَقَةٌ، وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ، وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ. قَالُوا: يَا رَسُولَ اللَّهِ أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إذَا وَضَعَهَا فِي الْحَلَالِ، كَانَ لَهُ أَجْرٌ\"",
      "arabic_plain": "عن أبي ذر رضي الله عنه أيضا، \"أن ناسا من أصحاب رسول الله صلى الله عليه و سلم قالوا للنبي صلى الله عليه و سلم يا رسول الله ذهب أهل الدثور بالأجور؛ يصلون كما نصلي، ويصومون كما نصوم، ويتصدقون بفضول أموالهم. قال: أوليس قد جعل الله لكم ما تصدقون؟ إن بكل تسبيحة صدقة، وكل تكبيرة صدقة، وكل تحميدة صدقة، وكل تهليلة صدقة، وأمر بمعروف صدقة، ونهي عن منكر صدقة، وفي بضع أحدكم صدقة. قالوا: يا رسول الله أيأتي أحدنا شهوته ويكون له فيها أجر؟ قال: أرأيتم لو وضعها في حرام أكان عليه وزر؟ فكذلك إذا وضعها في الحلال، كان له أجر\". \n",
      "arabic_hadith_text_plain": "\"أن ناسا من أصحاب رسول الله صلى الله عليه و سلم قالوا للنبي صلى الله عليه و سلم يا رسول الله ذهب أهل الدثور بالأجور؛ يصلون كما نصلي، ويصومون كما نصوم، ويتصدقون بفضول أموالهم. قال: أوليس قد جعل الله لكم ما تصدقون؟ إن بكل تسبيحة صدقة، وكل تكبيرة صدقة، وكل تحميدة صدقة، وكل تهليلة صدقة، وأمر بمعروف صدقة، ونهي عن منكر صدقة، وفي بضع أحدكم صدقة. قالوا: يا رسول الله أيأتي أحدنا شهوته ويكون له فيها أجر؟ قال: أرأيتم لو وضعها في حرام أكان عليه وزر؟ فكذلك إذا وضعها في الحلال، كان له أجر\"",
      "related_hadiths": [
        23,
        29,
        3,
        26
      ]
    },
    {
      "id": 40969,
      "idInBook": 26,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "كثرة طرق الخير",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ تَمْشِيهَا إلَى الصَّلَاةِ صَدَقَةٌ، وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ\". \n \n، ",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “Every joint of a person must perform a charity each day that the sun rises: to judge justly between two people is a charity. To help a man with his mount, lifting him onto it or hoisting up his belongings onto it, is a charity. And the good word is a charity. And every step that you take towards the prayer is a charity, and removing a harmful object from the road is a charity.”\n\n\n"
      },
      "vocabulary": [
        "سلامى: المفصل العظمي (وفي الإنسان 360 مفصلاً).",
        "عليه صدقة: شكر واجب لله على سلامة هذا المفصل.",
        "تعدل بين اثنين: تصلح بينهما أو تحكم بالعدل.",
        "تميط الأذى: تزيل ما يؤذي المارة من شوك أو حجر أو قاذورات."
      ],
      "benefits": [
        "وجوب شكر نعم الله البدنية كل يوم.",
        "أبواب الخير كثيرة وميسرة (الكلمة الطيبة، المساعدة، الإصلاح).",
        "إماطة الأذى عن الطريق من شعب الإيمان."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الصدقة",
          "النية",
          "التسبيح",
          "المعروف",
          "الصلة"
        ],
        "english": [
          "Charity",
          "Intention",
          "Glorification",
          "Good Deeds",
          "Ties of Kinship"
        ],
        "category_arabic": "الأعمال الصالحة",
        "category_english": "Righteous Deeds"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ تَمْشِيهَا إلَى الصَّلَاةِ صَدَقَةٌ، وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ\"",
      "arabic_plain": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم \"كل سلامى من الناس عليه صدقة، كل يوم تطلع فيه الشمس تعدل بين اثنين صدقة، وتعين الرجل في دابته فتحمله عليها أو ترفع له عليها متاعه صدقة، والكلمة الطيبة صدقة، وبكل خطوة تمشيها إلى الصلاة صدقة، وتميط الأذى عن الطريق صدقة\". \n \n، ",
      "arabic_hadith_text_plain": "\"كل سلامى من الناس عليه صدقة، كل يوم تطلع فيه الشمس تعدل بين اثنين صدقة، وتعين الرجل في دابته فتحمله عليها أو ترفع له عليها متاعه صدقة، والكلمة الطيبة صدقة، وبكل خطوة تمشيها إلى الصلاة صدقة، وتميط الأذى عن الطريق صدقة\"",
      "related_hadiths": [
        23,
        25,
        29,
        38
      ]
    },
    {
      "id": 40970,
      "idInBook": 27,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "البر وحسن الخلق",
      "narrator": {
        "arabic": "النَّوَّاسُ بْنُ سَمْعَانَ",
        "english": "al-Nawwas ibn Sam'an",
        "kunya_arabic": "لا تُعرف له كنية مشهورة",
        "kunya_english": "No well-known kunya recorded",
        "full_name_arabic": "النَّوَّاسُ بْنُ سَمْعَانَ الْأَنْصَارِيُّ",
        "full_name_english": "al-Nawwas ibn Sam'an al-Ansari",
        "title_arabic": "",
        "title_english": "",
        "died_ah": 50,
        "died_ce": 670,
        "tribe_arabic": "كلاب",
        "tribe_english": "Kilab",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 16,
        "bio_arabic": "صحابي من أهل الشام، روى عنه جماعة من التابعين.",
        "bio_english": "A Companion from Syria, narrated from by a group of Tabiun."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم",
          "سنن الترمذي"
        ],
        "books_english": [
          "Sahih Muslim",
          "Jami al-Tirmidhi"
        ],
        "grade_arabic": "رواه مسلم والترمذي",
        "grade_english": "Narrated by Muslim and al-Tirmidhi"
      },
      "arabic": "عَنْ النَّوَّاسِ بْنِ سَمْعَانَ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: \"الْبِرُّ حُسْنُ الْخُلُقِ، وَالْإِثْمُ مَا حَاكَ فِي صَدْرِك، وَكَرِهْت أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ\"",
      "english": {
        "narrator": "On the authority of an-Nawas bin Sam’an (may Allah be pleased with him), that the Prophet (peace and blessings of Allah be upon him) said:",
        "text": "Righteousness is in good character, and wrongdoing is that which wavers in your soul, and which you dislike people finding out about.\n\n\nAnd on the authority of Wabisah bin Ma’bad (may Allah be pleased with him) who said:\n\nI came to the Messenger of Allah (peace and blessings of Allah be upon him) and he (peace and blessings of Allah be upon him) said, “You have come to ask about righteousness.” I said, “Yes.” He (peace and blessings of Allah be upon him) said, “Consult your heart. Righteousness is that about which the soul feels at ease and the heart feels tranquil. And wrongdoing is that which wavers in the soul and causes uneasiness in the breast, even though people have repeatedly given their legal opinion .”\n\nA good hadeeth transmitted from the musnads of the two imams, Ahmed bin Hambal and Al- Darimi, with a good chain of authorities."
      },
      "vocabulary": [
        "البر: اسم جامع لكل خصال الخير.",
        "حاك في نفسك: تردد واضطرب ولم تنشرح له الصدر.",
        "استفت قلبك: ارجع إلى ما يطمئن إليه قلبك المؤمن النقي.",
        "وإن أفتاك الناس: وإن أوجدوا لك رخصاً أو مخارج تخالف طمأنينة القلب."
      ],
      "benefits": [
        "حسن الخلق هو الركن الأعظم في البر.",
        "للمؤمن بصيرة وفراسة (حساسية الضمير) تميز بين الحلال والحرام.",
        "الإثم يورث قلقاً في النفس وخوفاً من اطلاع الناس."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "البر",
          "الإثم",
          "ضيق الصدر",
          "الحلال والحرام",
          "الضمير"
        ],
        "english": [
          "Righteousness",
          "Sin",
          "Chest Tightening",
          "Halal & Haram",
          "Conscience"
        ],
        "category_arabic": "الأخلاق",
        "category_english": "Ethics"
      },
      "arabic_narrator_intro": "عَنْ النَّوَّاسِ بْنِ سَمْعَانَ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"الْبِرُّ حُسْنُ الْخُلُقِ، وَالْإِثْمُ مَا حَاكَ فِي صَدْرِك، وَكَرِهْت أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ\"",
      "arabic_plain": "عن النواس بن سمعان رضي الله عنه عن النبي صلى الله عليه و سلم قال: \"البر حسن الخلق، والإثم ما حاك في صدرك، وكرهت أن يطلع عليه الناس\"",
      "arabic_hadith_text_plain": "\"البر حسن الخلق، والإثم ما حاك في صدرك، وكرهت أن يطلع عليه الناس\"",
      "related_hadiths": [
        6,
        11
      ]
    },
    {
      "id": 40971,
      "idInBook": 28,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "لزوم السنة والتحذير من البدع",
      "narrator": {
        "arabic": "الْعِرْبَاضُ بْنُ سَارِيَةَ",
        "english": "al-Irbad ibn Sariyah",
        "kunya_arabic": "أبو نجيح",
        "kunya_english": "Abu Najeeh",
        "full_name_arabic": "الْعِرْبَاضُ بْنُ سَارِيَةَ السُّلَمِيُّ",
        "full_name_english": "al-Irbad ibn Sariyah al-Sulami",
        "title_arabic": "من أهل الصفة",
        "title_english": "From the People of the Suffah",
        "died_ah": 75,
        "died_ce": 694,
        "tribe_arabic": "سليم",
        "tribe_english": "Sulaym",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 30,
        "bio_arabic": "من أهل الصفة، سكن حمص بالشام، روى موعظة النبي ﷺ المؤثرة التي بكى منها الصحابة.",
        "bio_english": "From the People of the Suffah, settled in Homs, Syria. He narrated the moving sermon of the Prophet ﷺ that moved the Companions to tears."
      },
      "source": {
        "books_arabic": [
          "سنن أبي داود",
          "سنن الترمذي",
          "سنن ابن ماجه"
        ],
        "books_english": [
          "Sunan Abu Dawud",
          "Jami al-Tirmidhi",
          "Sunan Ibn Majah"
        ],
        "grade_arabic": "صحيح",
        "grade_english": "Sahih"
      },
      "arabic": "عَنْ أَبِي نَجِيحٍ الْعِرْبَاضِ بْنِ سَارِيَةَ رَضِيَ اللهُ عَنْهُ قَالَ: \"وَعَظَنَا رَسُولُ اللَّهِ صلى الله عليه و سلم مَوْعِظَةً وَجِلَتْ مِنْهَا الْقُلُوبُ، وَذَرَفَتْ مِنْهَا الْعُيُونُ، فَقُلْنَا: يَا رَسُولَ اللَّهِ! كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا، قَالَ: أُوصِيكُمْ بِتَقْوَى اللَّهِ، وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا، فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيينَ، عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ، وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ؛ فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ\". \n \n  وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ",
      "english": {
        "narrator": "On the authority of Abu Najeeh al-’Irbaad ibn Saariyah (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) gave us a sermon by which our hearts were filled with fear and tears came to our eyes. So we said, “O Messenger of Allah! It is as though this is a farewell sermon, so counsel us.” He (peace and blessings of Allah be upon him) said, “I counsel you to have taqwa (fear) of Allah, and to listen and obey , for verily every bidah (innovation) is misguidance.”\n\nIt was related by at-Tirmidhi, who said that it was a good and sound hadeeth."
      },
      "vocabulary": [
        "وجلت: خافت وارتعدت.",
        "موعظة مودع: بليغة ومؤثرة كمن يوصي عند الموت.",
        "تأمر عليكم عبد: صار والياً عليكم.",
        "عضوا عليها بالنواجذ: تمسكوا بها بشدة (النواجذ هي الأضراس).",
        "محدثات الأمور: ما أحدث في الدين مما لا أصل له."
      ],
      "benefits": [
        "الوصية بالتقوى والسمع والطاعة هي صمام أمان للأمة عند الفتن.",
        "الإخبار بوقوع الاختلاف والفرقة في الأمة.",
        "المخرج الوحيد عند الفتن هو التمسك بسنة النبي ﷺ وسنة الخلفاء الراشدين.",
        "التحذير الشديد من البدع لأنها ضلالة."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "السنة",
          "البدعة",
          "الخلفاء الراشدون",
          "الطاعة",
          "التمسك بالسنة"
        ],
        "english": [
          "Sunnah",
          "Innovation",
          "Rightly-Guided Caliphs",
          "Obedience",
          "Adhering to Sunnah"
        ],
        "category_arabic": "المنهج والسنة",
        "category_english": "Method & Sunnah"
      },
      "arabic_narrator_intro": "عَنْ أَبِي نَجِيحٍ الْعِرْبَاضِ بْنِ سَارِيَةَ رَضِيَ اللهُ عَنْهُ قَالَ",
      "arabic_hadith_text": "\"وَعَظَنَا رَسُولُ اللَّهِ صلى الله عليه و سلم مَوْعِظَةً وَجِلَتْ مِنْهَا الْقُلُوبُ، وَذَرَفَتْ مِنْهَا الْعُيُونُ، فَقُلْنَا: يَا رَسُولَ اللَّهِ! كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا، قَالَ: أُوصِيكُمْ بِتَقْوَى اللَّهِ، وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا، فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيينَ، عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ، وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ؛ فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ\".",
      "arabic_plain": "عن أبي نجيح العرباض بن سارية رضي الله عنه قال: \"وعظنا رسول الله صلى الله عليه و سلم موعظة وجلت منها القلوب، وذرفت منها العيون، فقلنا: يا رسول الله! كأنها موعظة مودع فأوصنا، قال: أوصيكم بتقوى الله، والسمع والطاعة وإن تأمر عليكم عبد، فإنه من يعش منكم فسيرى اختلافا كثيرا، فعليكم بسنتي وسنة الخلفاء الراشدين المهديين، عضوا عليها بالنواجذ، وإياكم ومحدثات الأمور؛ فإن كل بدعة ضلالة\". \n \n  وقال: حديث حسن صحيح",
      "arabic_hadith_text_plain": "\"وعظنا رسول الله صلى الله عليه و سلم موعظة وجلت منها القلوب، وذرفت منها العيون، فقلنا: يا رسول الله! كأنها موعظة مودع فأوصنا، قال: أوصيكم بتقوى الله، والسمع والطاعة وإن تأمر عليكم عبد، فإنه من يعش منكم فسيرى اختلافا كثيرا، فعليكم بسنتي وسنة الخلفاء الراشدين المهديين، عضوا عليها بالنواجذ، وإياكم ومحدثات الأمور؛ فإن كل بدعة ضلالة\".",
      "related_hadiths": [
        5,
        20,
        9
      ]
    },
    {
      "id": 40972,
      "idInBook": 29,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "أبواب الخير والجهاد",
      "narrator": {
        "arabic": "مُعَاذُ بْنُ جَبَلٍ",
        "english": "Muadh ibn Jabal",
        "kunya_arabic": "أبو عبد الرحمن",
        "kunya_english": "Abu Abd al-Rahman",
        "full_name_arabic": "مُعَاذُ بْنُ جَبَلٍ الْأَنْصَارِيُّ",
        "full_name_english": "Muadh ibn Jabal al-Ansari",
        "title_arabic": "أعلم الأمة بالحلال والحرام",
        "title_english": "Most Knowledgeable of the Ummah in Halal & Haram",
        "died_ah": 18,
        "died_ce": 639,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 157,
        "bio_arabic": "قال عنه النبي ﷺ: \"أعلم أمتي بالحلال والحرام معاذ بن جبل\"، بعثه النبي معلماً لليمن.",
        "bio_english": "The Prophet ﷺ said about him: 'The most knowledgeable of my Ummah regarding halal and haram is Muadh ibn Jabal.' The Prophet sent him as a teacher to Yemen."
      },
      "source": {
        "books_arabic": [
          "سنن الترمذي",
          "سنن ابن ماجه"
        ],
        "books_english": [
          "Jami al-Tirmidhi",
          "Sunan Ibn Majah"
        ],
        "grade_arabic": "حسن صحيح",
        "grade_english": "Hasan Sahih"
      },
      "arabic": "عَنْ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللهُ عَنْهُ قَالَ: قُلْت يَا رَسُولَ اللَّهِ! أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدْنِي مِنْ النَّارِ، قَالَ: \"لَقَدْ سَأَلْت عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ: تَعْبُدُ اللَّهَ لَا تُشْرِكْ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ، ثُمَّ قَالَ: أَلَا أَدُلُّك عَلَى أَبْوَابِ الْخَيْرِ؟ الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ، ثُمَّ تَلَا: \" تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ \" حَتَّى بَلَغَ \"يَعْمَلُونَ\"، ثُمَّ قَالَ: أَلَا أُخْبِرُك بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذُرْوَةِ سَنَامِهِ؟ قُلْت: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: رَأْسُ الْأَمْرِ الْإِسْلَامُ، وَعَمُودُهُ الصَّلَاةُ، وَذُرْوَةُ سَنَامِهِ الْجِهَادُ، ثُمَّ قَالَ: أَلَا أُخْبِرُك بِمَلَاكِ ذَلِكَ كُلِّهِ؟ فقُلْت: بَلَى يَا رَسُولَ اللَّهِ ! فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْك هَذَا. قُلْت: يَا نَبِيَّ اللَّهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: ثَكِلَتْك أُمُّك وَهَلْ يَكُبُّ النَّاسَ عَلَى وُجُوهِهِمْ -أَوْ قَالَ عَلَى مَنَاخِرِهِمْ- إلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟!\" ",
      "english": {
        "narrator": "On the authority of Muadh bin Jabal (may Allah be pleased with him) who said:",
        "text": "I said, “O Messenger of Allah, tell me of an act which will take me into Paradise and will keep me away from the Hellfire.” He (peace and blessings of Allah be upon him) said, “You have asked me about a great matter, yet it is easy for him for whom Allah makes it easy: worship Allah, without associating any partners with Him; establish the prayer; pay the zakat; fast in Ramadhan; and make the pilgrimage to the House.”\n\nThen he (peace and blessings of Allah be upon him) said, “Shall I not guide you towards the means of goodness? Fasting is a shield; charity wipes away sin as water extinguishes fire; and the praying of a man in the depths of the night.” Then he (peace and blessings of Allah be upon him) recited: “\n\nThen he (peace and blessings of Allah be upon him) said, “Shall I not inform you of the head of the matter, its pillar and its peak?” I said, “Yes, O Messenger of Allah.” He (peace and blessings of Allah be upon him) said, “The head of the matter is Islam, its pillar is the prayer and its peak is jihad.” Then he (peace and blessings of Allah be upon him) said, “Shall I not tell you of the foundation of all of that?” I said, “Yes, O Messenger of Allah.” So he took hold of his tongue and said, “Restrain this.”\n\nI said, “O Prophet of Allah, will we be taken to account for what we say with it?” He (peace and blessings of Allah be upon him) said, “May your mother be bereaved of you, O Muadh! Is there anything that throws people into the Hellfire upon their faces — or: on their noses — except the harvests of their tongues?”\n\nIt was related by at-Tirmidhi, who said it was a good and sound hadeeth."
      },
      "vocabulary": [
        "لقد سألت عن عظيم: أمر ذو شأن كبير وصعب إلا من يسره الله.",
        "جنة: وقاية وستر من النار.",
        "تتجافى جنوبهم: ترتفع عن الفرش للقيام للصلاة.",
        "ذروة سنامه: أعلى شيء في الإسلام.",
        "ثكلتك أمك: فقدتك (دعاء لا يراد به حقيقته بل للتنبيه).",
        "حصائد ألسنتهم: ما تكلموا به من السوء وجزاؤه."
      ],
      "benefits": [
        "الجمع بين أركان الإسلام وأبواب الخير (النوافل).",
        "قيام الليل والصدقة والصوم من مكفرات الذنوب.",
        "الجهاد هو ذروة سنام الإسلام وبه عزته.",
        "خطر اللسان عظيم، وهو من أكثر أسباب دخول النار."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "فضل الأعمال",
          "الصلاة",
          "الصيام",
          "الصدقة",
          "الجهاد",
          "اللسان"
        ],
        "english": [
          "Virtue of Deeds",
          "Prayer",
          "Fasting",
          "Charity",
          "Jihad",
          "Tongue"
        ],
        "category_arabic": "العبادات والأخلاق",
        "category_english": "Worship & Ethics"
      },
      "arabic_narrator_intro": "عَنْ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللهُ عَنْهُ قَالَ: قُلْت يَا رَسُولَ اللَّهِ! أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدْنِي مِنْ النَّارِ، قَالَ",
      "arabic_hadith_text": "\"لَقَدْ سَأَلْت عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ: تَعْبُدُ اللَّهَ لَا تُشْرِكْ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ، ثُمَّ قَالَ: أَلَا أَدُلُّك عَلَى أَبْوَابِ الْخَيْرِ؟ الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ، ثُمَّ تَلَا: \" تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ \" حَتَّى بَلَغَ \"يَعْمَلُونَ\"، ثُمَّ قَالَ: أَلَا أُخْبِرُك بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذُرْوَةِ سَنَامِهِ؟ قُلْت: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: رَأْسُ الْأَمْرِ الْإِسْلَامُ، وَعَمُودُهُ الصَّلَاةُ، وَذُرْوَةُ سَنَامِهِ الْجِهَادُ، ثُمَّ قَالَ: أَلَا أُخْبِرُك بِمَلَاكِ ذَلِكَ كُلِّهِ؟ فقُلْت: بَلَى يَا رَسُولَ اللَّهِ ! فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْك هَذَا. قُلْت: يَا نَبِيَّ اللَّهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: ثَكِلَتْك أُمُّك وَهَلْ يَكُبُّ النَّاسَ عَلَى وُجُوهِهِمْ -أَوْ قَالَ عَلَى مَنَاخِرِهِمْ- إلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟!\"",
      "arabic_plain": "عن معاذ بن جبل رضي الله عنه قال: قلت يا رسول الله! أخبرني بعمل يدخلني الجنة ويباعدني من النار، قال: \"لقد سألت عن عظيم، وإنه ليسير على من يسره الله عليه: تعبد الله لا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت، ثم قال: ألا أدلك على أبواب الخير؟ الصوم جنة، والصدقة تطفئ الخطيئة كما يطفئ الماء النار، وصلاة الرجل في جوف الليل، ثم تلا: \" تتجافى جنوبهم عن المضاجع \" حتى بلغ \"يعملون\"، ثم قال: ألا أخبرك برأس الأمر وعموده وذروة سنامه؟ قلت: بلى يا رسول الله. قال: رأس الأمر الإسلام، وعموده الصلاة، وذروة سنامه الجهاد، ثم قال: ألا أخبرك بملاك ذلك كله؟ فقلت: بلى يا رسول الله ! فأخذ بلسانه وقال: كف عليك هذا. قلت: يا نبي الله وإنا لمؤاخذون بما نتكلم به؟ فقال: ثكلتك أمك وهل يكب الناس على وجوههم -أو قال على مناخرهم- إلا حصائد ألسنتهم؟!\" ",
      "arabic_hadith_text_plain": "\"لقد سألت عن عظيم، وإنه ليسير على من يسره الله عليه: تعبد الله لا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت، ثم قال: ألا أدلك على أبواب الخير؟ الصوم جنة، والصدقة تطفئ الخطيئة كما يطفئ الماء النار، وصلاة الرجل في جوف الليل، ثم تلا: \" تتجافى جنوبهم عن المضاجع \" حتى بلغ \"يعملون\"، ثم قال: ألا أخبرك برأس الأمر وعموده وذروة سنامه؟ قلت: بلى يا رسول الله. قال: رأس الأمر الإسلام، وعموده الصلاة، وذروة سنامه الجهاد، ثم قال: ألا أخبرك بملاك ذلك كله؟ فقلت: بلى يا رسول الله ! فأخذ بلسانه وقال: كف عليك هذا. قلت: يا نبي الله وإنا لمؤاخذون بما نتكلم به؟ فقال: ثكلتك أمك وهل يكب الناس على وجوههم -أو قال على مناخرهم- إلا حصائد ألسنتهم؟!\"",
      "related_hadiths": [
        8,
        23,
        25,
        3
      ]
    },
    {
      "id": 40973,
      "idInBook": 30,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "الوقوف عند حدود الله",
      "narrator": {
        "arabic": "أَبُو ثَعْلَبَةَ الْخُشَنِيُّ",
        "english": "Abu Tha'labah al-Khushani",
        "kunya_arabic": "أبو ثعلبة",
        "kunya_english": "Abu Tha'labah",
        "full_name_arabic": "جُرْثُومُ بْنُ نَاشِرٍ الْخُشَنِيُّ",
        "full_name_english": "Jurthum ibn Nashir al-Khushani",
        "title_arabic": "",
        "title_english": "",
        "died_ah": 75,
        "died_ce": 694,
        "tribe_arabic": "خشين",
        "tribe_english": "Khushayn",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 12,
        "bio_arabic": "صحابي جليل، شهد بيعة الرضوان، روى أحاديث في الحلال والحرام والفقه.",
        "bio_english": "A distinguished Companion who witnessed the Bay'at al-Ridwan. Narrated hadiths on halal, haram, and jurisprudence."
      },
      "source": {
        "books_arabic": [
          "سنن الدارقطني"
        ],
        "books_english": [
          "Sunan al-Daraqutni"
        ],
        "grade_arabic": "حسن",
        "grade_english": "Hasan"
      },
      "arabic": "عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ جُرْثُومِ بن نَاشِر رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَال: \"إنَّ اللَّهَ تَعَالَى فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا، وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا، وَحَرَّمَ أَشْيَاءَ فَلَا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا\". \nحَدِيثٌ حَسَنٌ،",
      "english": {
        "narrator": "On the authority of Abu Tha’labah al-Kushanee — Jurthoom bin Nashir (may Allah be pleased with him) — that the Messenger of Allah (peace and blessings of Allah be upon him) said:",
        "text": "Verily Allah ta’ala has laid down religious obligations (fara’id), so do not neglect them; and He has set limits, so do not overstep them; and He has forbidden some things, so do not violate them; and He has remained silent about some things, out of compassion for you, not forgetfulness — so do not seek after them.\n\nA hasan hadeeth narrated by ad-Daraqutnee and others."
      },
      "vocabulary": [
        "فرض فرائض: أوجب واجبات.",
        "حد حدوداً: جعل فواصل بين الحلال والحرام، وقيل هي العقوبات المقدرة.",
        "فلا تعتدوها: لا تتجاوزوها.",
        "سكت عن أشياء: لم ينزل فيها حكماً خاصاً.",
        "فلا تبحثوا عنها: لا تنقبوا عنها وتشددوا على أنفسكم."
      ],
      "benefits": [
        "تقسيم الأحكام الشرعية (واجبات، محرمات، حدود، ومباحات).",
        "ما سكت الشرع عنه فهو عفو (مباح) رحمةً من الله.",
        "النهي عن التنطع والبحث عما لا مصلحة فيه."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الفرائض",
          "الحدود",
          "المحرمات",
          "السكوت عن المباح",
          "الفقه"
        ],
        "english": [
          "Obligations",
          "Limits",
          "Prohibitions",
          "Silence on Permissible",
          "Jurisprudence"
        ],
        "category_arabic": "الفقه والشريعة",
        "category_english": "Jurisprudence & Law"
      },
      "arabic_narrator_intro": "عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ جُرْثُومِ بن نَاشِر رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَال",
      "arabic_hadith_text": "\"إنَّ اللَّهَ تَعَالَى فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا، وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا، وَحَرَّمَ أَشْيَاءَ فَلَا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا\"",
      "arabic_plain": "عن أبي ثعلبة الخشني جرثوم بن ناشر رضي الله عنه عن رسول الله صلى الله عليه و سلم قال: \"إن الله تعالى فرض فرائض فلا تضيعوها، وحد حدودا فلا تعتدوها، وحرم أشياء فلا تنتهكوها، وسكت عن أشياء رحمة لكم غير نسيان فلا تبحثوا عنها\". \nحديث حسن،",
      "arabic_hadith_text_plain": "\"إن الله تعالى فرض فرائض فلا تضيعوها، وحد حدودا فلا تعتدوها، وحرم أشياء فلا تنتهكوها، وسكت عن أشياء رحمة لكم غير نسيان فلا تبحثوا عنها\"",
      "related_hadiths": [
        14,
        32
      ]
    },
    {
      "id": 40974,
      "idInBook": 31,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "حقيقة الزهد",
      "narrator": {
        "arabic": "سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ",
        "english": "Sahl ibn Sa'd al-Sa'idi",
        "kunya_arabic": "أبو العباس",
        "kunya_english": "Abu al-Abbas",
        "full_name_arabic": "سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ",
        "full_name_english": "Sahl ibn Sa'd al-Sa'idi",
        "title_arabic": "آخر من مات من الصحابة بالمدينة",
        "title_english": "Last Companion to die in Madinah",
        "died_ah": 91,
        "died_ce": 710,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 188,
        "bio_arabic": "عاش حتى بلغ مئة سنة، وكان آخر من مات من الصحابة في المدينة المنورة.",
        "bio_english": "Lived to the age of one hundred, and was the last Companion to die in Madinah."
      },
      "source": {
        "books_arabic": [
          "سنن ابن ماجه"
        ],
        "books_english": [
          "Sunan Ibn Majah"
        ],
        "grade_arabic": "حسن",
        "grade_english": "Hasan"
      },
      "arabic": "عَنْ أَبِي الْعَبَّاسِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيّ رَضِيَ اللهُ عَنْهُ قَالَ: جَاءَ رَجُلٌ إلَى النَّبِيِّ صلى الله عليه و سلم فَقَالَ: يَا رَسُولَ اللهِ! دُلَّنِي عَلَى عَمَلٍ إذَا عَمِلْتُهُ أَحَبَّنِي اللهُ وَأَحَبَّنِي النَّاسُ؛ فَقَالَ: \"ازْهَدْ فِي الدُّنْيَا يُحِبَّك اللهُ، وَازْهَدْ فِيمَا عِنْدَ النَّاسِ يُحِبَّك النَّاسُ\" . \nحديث حسن،",
      "english": {
        "narrator": "On the authority of Abu al-’Abbas Sahl bin Sa’ad as-Sa’idee (may Allah be pleased with him) who said:",
        "text": "A man came to the Prophet (peace and blessings of Allah be upon him) and said, “O Messenger of Allah, direct me to an act which, if I do it,  Allah to love me and the people to love me.” So he (peace and blessings of Allah be upon him) said, “Renounce the world and Allah will love you, and renounce what the people possess and the people will love you.”\n\nA hasan hadeeth related by Ibn Majah and others with good chains of authorities."
      },
      "vocabulary": [
        "ازهد في الدنيا: لا تجعل الدنيا أكبر همك، وخذ منها قدر الحاجة.",
        "ازهد فيما عند الناس: لا تتطلع لما في أيديهم ولا تسألهم."
      ],
      "benefits": [
        "طريق محبة الله هو الزهد في الدنيا (بأن تكون في اليد لا في القلب).",
        "طريق محبة الناس هو الاستغناء عما في أيديهم والتعفف.",
        "الحث على القناعة وترك الطمع."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الزهد في الدنيا",
          "محبة الله",
          "محبة الناس",
          "التواضع"
        ],
        "english": [
          "Asceticism",
          "Love of Allah",
          "Love of People",
          "Humility"
        ],
        "category_arabic": "الزهد والأخلاق",
        "category_english": "Asceticism & Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَبِي الْعَبَّاسِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيّ رَضِيَ اللهُ عَنْهُ قَالَ: جَاءَ رَجُلٌ إلَى النَّبِيِّ صلى الله عليه و سلم فَقَالَ: يَا رَسُولَ اللهِ! دُلَّنِي عَلَى عَمَلٍ إذَا عَمِلْتُهُ أَحَبَّنِي اللهُ وَأَحَبَّنِي النَّاسُ؛ فَقَالَ",
      "arabic_hadith_text": "\"ازْهَدْ فِي الدُّنْيَا يُحِبَّك اللهُ، وَازْهَدْ فِيمَا عِنْدَ النَّاسِ يُحِبَّك النَّاسُ\"",
      "arabic_plain": "عن أبي العباس سهل بن سعد الساعدي رضي الله عنه قال: جاء رجل إلى النبي صلى الله عليه و سلم فقال: يا رسول الله! دلني على عمل إذا عملته أحبني الله وأحبني الناس؛ فقال: \"ازهد في الدنيا يحبك الله، وازهد فيما عند الناس يحبك الناس\" . \nحديث حسن،",
      "arabic_hadith_text_plain": "\"ازهد في الدنيا يحبك الله، وازهد فيما عند الناس يحبك الناس\"",
      "related_hadiths": [
        40,
        19,
        25,
        10
      ]
    },
    {
      "id": 40975,
      "idInBook": 32,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "لا ضرر ولا ضرار",
      "narrator": {
        "arabic": "سَعْدُ بْنُ مَالِكٍ الْخُدْرِيُّ",
        "english": "Sa'd ibn Malik al-Khudri (Abu Sa'id)",
        "kunya_arabic": "أبو سعيد",
        "kunya_english": "Abu Sa'id",
        "full_name_arabic": "سَعْدُ بْنُ مَالِكٍ الْخُدْرِيُّ",
        "full_name_english": "Sa'd ibn Malik al-Khudri",
        "title_arabic": "المفتي",
        "title_english": "The Jurist",
        "died_ah": 74,
        "died_ce": 693,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 1170,
        "bio_arabic": "من أكثر الصحابة فتوى ورواية، شهد المشاهد كلها مع النبي ﷺ ما عدا بدراً.",
        "bio_english": "One of the most prolific in issuing fatwas and narrating hadiths. Witnessed all battles with the Prophet ﷺ except Badr."
      },
      "source": {
        "books_arabic": [
          "سنن ابن ماجه",
          "سنن الدارقطني",
          "موطأ مالك"
        ],
        "books_english": [
          "Sunan Ibn Majah",
          "Sunan al-Daraqutni",
          "Muwatta Malik"
        ],
        "grade_arabic": "حسن",
        "grade_english": "Hasan (Good)"
      },
      "arabic": "عَنْ أَبِي سَعِيدٍ سَعْدِ بْنِ مَالِكِ بْنِ سِنَانٍ الْخُدْرِيّ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \" لَا ضَرَرَ وَلَا ضِرَارَ\" . \nحَدِيثٌ حَسَنٌ،",
      "english": {
        "narrator": "On the authority of Abu Sa’eed al-Khudree (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:",
        "text": "There should be neither harming (darar) nor reciprocating harm (dirar).\n\nA hasan hadeeth related by Ibn Majah, ad-Daraqutnee and others as a musnad hadeeth. It was also related by Malik in al-Muwatta in mursal form from Amr bin Yahya, from his father from the Prophet (peace and blessings of Allah be upon him), but leaving Abu Sa’eed from the chain. And it has other chains of narrations that strengthen one another."
      },
      "vocabulary": [
        "لا ضرر: لا تلحق الأذى بنفسك أو بغيرك ابتداءً.",
        "لا ضرار: لا تقابل الضرر بضرر مثله على وجه الانتقام غير المشروع (أو الإضرار بالغير بما تنتفع به أنت)."
      ],
      "benefits": [
        "قاعدة فقهية كبرى: الضرر يزال.",
        "تحريم كل ما يضر الإنسان في دينه أو دنياه أو عقله أو ماله.",
        "الإسلام دين الرحمة ورفع الحرج ودفع المفاسد."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "لا ضرر ولا ضرار",
          "الفقه",
          "حقوق الآخرين",
          "رفع الأذى"
        ],
        "english": [
          "No Harm",
          "Jurisprudence",
          "Others' Rights",
          "Removing Harm"
        ],
        "category_arabic": "القواعد الفقهية",
        "category_english": "Legal Maxims"
      },
      "arabic_narrator_intro": "عَنْ أَبِي سَعِيدٍ سَعْدِ بْنِ مَالِكِ بْنِ سِنَانٍ الْخُدْرِيّ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\" لَا ضَرَرَ وَلَا ضِرَارَ\"",
      "arabic_plain": "عن أبي سعيد سعد بن مالك بن سنان الخدري رضي الله عنه أن رسول الله صلى الله عليه و سلم قال: \" لا ضرر ولا ضرار\" . \nحديث حسن،",
      "arabic_hadith_text_plain": "\" لا ضرر ولا ضرار\"",
      "related_hadiths": [
        30,
        33,
        14,
        6
      ]
    },
    {
      "id": 40976,
      "idInBook": 33,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "البينة على المدعي",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "english": "Abdullah ibn Abbas",
        "kunya_arabic": "أبو العباس",
        "kunya_english": "Abu al-Abbas",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "full_name_english": "Abdullah ibn Abbas",
        "title_arabic": "حبر الأمة، ترجمان القرآن",
        "title_english": "Scholar of the Ummah, Interpreter of the Quran",
        "died_ah": 68,
        "died_ce": 687,
        "tribe_arabic": "قريش - بنو هاشم",
        "tribe_english": "Quraysh - Banu Hashim",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 1660,
        "bio_arabic": "ابن عم النبي ﷺ، دعا له النبي بالفقه في الدين، يُعدّ من أعلم الصحابة بالتفسير والفقه.",
        "bio_english": "Cousin of the Prophet ﷺ, for whom the Prophet supplicated for deep understanding of religion. Considered the most knowledgeable Companion in Quranic interpretation."
      },
      "source": {
        "books_arabic": [
          "سنن البيهقي"
        ],
        "books_english": [
          "Sunan al-Bayhaqi"
        ],
        "grade_arabic": "حسن",
        "grade_english": "Hasan"
      },
      "arabic": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ، لَكِنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي، وَالْيَمِينَ عَلَى مَنْ أَنْكَرَ\" . \nحَدِيثٌ حَسَنٌ،",
      "english": {
        "narrator": "On the authority of Ibn Abbas (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:",
        "text": "Were people to be given everything that they claimed, men would  people. But, the onus of proof is upon the claimant, and the taking of an oath is upon him who denies.\n\nA hasan hadeeth narrated by al-Baihaqee and others in this form, and part of it is in the two Saheehs."
      },
      "vocabulary": [
        "بدعواهم: بمجرد زعمهم وطلبهم دون دليل.",
        "البينة: ما يبين الحق ويظهره (كالشهود والوثائق).",
        "اليمين: الحلف بالله."
      ],
      "benefits": [
        "حفظ الأموال والدماء من الادعاءات الكاذبة.",
        "أساس القضاء: المدعي عليه إثبات حقه، والمنكر عليه الحلف لنفي الدعوى.",
        "عدم قبول الدعوى بمجرد الكلام مهما كان صلاح المدعي."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "البينة",
          "اليمين",
          "القضاء",
          "الحقوق",
          "الشهادة"
        ],
        "english": [
          "Evidence",
          "Oath",
          "Judgment",
          "Rights",
          "Testimony"
        ],
        "category_arabic": "القضاء والفقه",
        "category_english": "Judiciary & Jurisprudence"
      },
      "arabic_narrator_intro": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ، لَكِنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي، وَالْيَمِينَ عَلَى مَنْ أَنْكَرَ\"",
      "arabic_plain": "عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه و سلم قال: \"لو يعطى الناس بدعواهم لادعى رجال أموال قوم ودماءهم، لكن البينة على المدعي، واليمين على من أنكر\" . \nحديث حسن،",
      "arabic_hadith_text_plain": "\"لو يعطى الناس بدعواهم لادعى رجال أموال قوم ودماءهم، لكن البينة على المدعي، واليمين على من أنكر\"",
      "related_hadiths": [
        3,
        8,
        32,
        14
      ]
    },
    {
      "id": 40977,
      "idInBook": 34,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "تغيير المنكر باليد والقلب",
      "narrator": {
        "arabic": "أَبُو سَعِيدٍ الْخُدْرِيُّ",
        "english": "Abu Sa'id al-Khudri",
        "kunya_arabic": "أبو سعيد",
        "kunya_english": "Abu Sa'id",
        "full_name_arabic": "سَعْدُ بْنُ مَالِكٍ بْنِ سِنَانٍ الْخُدْرِيُّ",
        "full_name_english": "Sa'd ibn Malik ibn Sinan al-Khudri",
        "title_arabic": "",
        "title_english": "",
        "died_ah": 74,
        "died_ce": 693,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 1170,
        "bio_arabic": "من فقهاء الصحابة ومكثريهم في الرواية، استشهد أبوه في غزوة أحد.",
        "bio_english": "One of the most learned and prolific Companions in narration. His father was martyred at the Battle of Uhud."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيّ رَضِيَ اللهُ عَنْهُ قَالَ سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ، وَذَلِكَ أَضْعَفُ الْإِيمَانِ\" . \n",
      "english": {
        "narrator": "On the authority of Abu Sa`eed al-Khudree (may Allah be pleased with him) who said:",
        "text": "I heard the Messenger of Allah (ﷺ) say, “Whosoever of you sees an evil, let him change it with his hand; and if he is not able to do so, then  with his tongue; and if he is not able to do so, then with his heart — and that is the weakest of faith.”\n\n"
      },
      "vocabulary": [
        "منكراً: معصية أو أمراً مخالفاً للشرع ظاهراً.",
        "فليغيره بيده: يزيله بالقوة (لمن له ولاية وسلطة).",
        "بقلبه: يكرهه وينكره باطناً ويعزم على تركه."
      ],
      "benefits": [
        "وجوب الأمر بالمعروف والنهي عن المنكر على قدر الاستطاعة.",
        "التدرج في التغيير: اليد للسلطان، واللسان للعلماء والدعاة، والقلب لعموم الناس.",
        "إنكار القلب فرض عين لا يسقط عن أحد، وهو دليل على بقاء أصل الإيمان."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الأمر بالمعروف",
          "النهي عن المنكر",
          "تغيير المنكر",
          "الإيمان"
        ],
        "english": [
          "Enjoining Good",
          "Forbidding Evil",
          "Changing Wrongdoing",
          "Faith"
        ],
        "category_arabic": "الأمر بالمعروف والنهي عن المنكر",
        "category_english": "Enjoining Good & Forbidding Evil"
      },
      "arabic_narrator_intro": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيّ رَضِيَ اللهُ عَنْهُ قَالَ سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ",
      "arabic_hadith_text": "\"مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ، وَذَلِكَ أَضْعَفُ الْإِيمَانِ\"",
      "arabic_plain": "عن أبي سعيد الخدري رضي الله عنه قال سمعت رسول الله صلى الله عليه و سلم يقول: \"من رأى منكم منكرا فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه، وذلك أضعف الإيمان\" . \n",
      "arabic_hadith_text_plain": "\"من رأى منكم منكرا فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه، وذلك أضعف الإيمان\"",
      "related_hadiths": [
        2,
        13,
        15,
        21
      ]
    },
    {
      "id": 40978,
      "idInBook": 35,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "أخوة الإسلام وحقوق المسلم",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \" لَا تَحَاسَدُوا، وَلَا تَنَاجَشُوا، وَلَا تَبَاغَضُوا، وَلَا تَدَابَرُوا، وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إخْوَانًا، الْمُسْلِمُ أَخُو الْمُسْلِمِ، لَا يَظْلِمُهُ، وَلَا يَخْذُلُهُ، وَلَا يَكْذِبُهُ، وَلَا يَحْقِرُهُ، التَّقْوَى هَاهُنَا، وَيُشِيرُ إلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ، بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ، كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ وَمَالُهُ وَعِرْضُهُ\" . \n",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “Do not envy one another, and do not inflate prices for one another, and do not hate one another, and do not turn away from one another, and do not undercut one another in trade, but . It is evil enough for a man to hold his brother Muslim in contempt. The whole of a Muslim is inviolable for another Muslim: his blood, his property, and his honour.”\n\n"
      },
      "vocabulary": [
        "لا تحاسدوا: لا يتمنى أحدكم زوال نعمة أخيه.",
        "لا تناجشوا: لا يزد أحد في السلعة وهو لا يريد شراءها ليخدع غيره.",
        "لا تدابروا: لا يعطِ أحدكم أخاه ظهره مقاطعةً وهجراً.",
        "لا يخذله: ينصره ويدافع عنه.",
        "بحسب امرئ من الشر: يكفيه من الشر والإثم."
      ],
      "benefits": [
        "حقوق الأخوة الإسلامية مبنية على التناصر والمحبة وترك الأذى.",
        "تحريم المعاملات القائمة على الغش والخداع (كالنجش).",
        "التقوى محلها القلب، وليس المظاهر.",
        "تحريم احتقار المسلم، فكل المسلمين سواسية عند الله."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الحقد",
          "الحسد",
          "التدابر",
          "الأخوة الإسلامية",
          "التقوى"
        ],
        "english": [
          "Grudges",
          "Envy",
          "Mutual Hatred",
          "Brotherhood",
          "Piety"
        ],
        "category_arabic": "الأخلاق الاجتماعية",
        "category_english": "Social Ethics"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\" لَا تَحَاسَدُوا، وَلَا تَنَاجَشُوا، وَلَا تَبَاغَضُوا، وَلَا تَدَابَرُوا، وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إخْوَانًا، الْمُسْلِمُ أَخُو الْمُسْلِمِ، لَا يَظْلِمُهُ، وَلَا يَخْذُلُهُ، وَلَا يَكْذِبُهُ، وَلَا يَحْقِرُهُ، التَّقْوَى هَاهُنَا، وَيُشِيرُ إلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ، بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ، كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ وَمَالُهُ وَعِرْضُهُ\"",
      "arabic_plain": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم \" لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، ولا تدابروا، ولا يبع بعضكم على بيع بعض، وكونوا عباد الله إخوانا، المسلم أخو المسلم، لا يظلمه، ولا يخذله، ولا يكذبه، ولا يحقره، التقوى هاهنا، ويشير إلى صدره ثلاث مرات، بحسب امرئ من الشر أن يحقر أخاه المسلم، كل المسلم على المسلم حرام: دمه وماله وعرضه\" . \n",
      "arabic_hadith_text_plain": "\" لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، ولا تدابروا، ولا يبع بعضكم على بيع بعض، وكونوا عباد الله إخوانا، المسلم أخو المسلم، لا يظلمه، ولا يخذله، ولا يكذبه، ولا يحقره، التقوى هاهنا، ويشير إلى صدره ثلاث مرات، بحسب امرئ من الشر أن يحقر أخاه المسلم، كل المسلم على المسلم حرام: دمه وماله وعرضه\"",
      "related_hadiths": [
        13,
        36,
        15,
        34
      ]
    },
    {
      "id": 40979,
      "idInBook": 36,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "قضاء حوائج المسلمين وفضل العلم",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih Muslim"
        ],
        "grade_arabic": "رواه مسلم",
        "grade_english": "Narrated by Muslim"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: \"مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ، يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ، وَمَنْ سَتَرَ مُسْلِما سَتَرَهُ اللهُ فِي الدُّنْيَا وَالْآخِرَةِ ، وَاَللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ، وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إلَى الْجَنَّةِ، وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ، وَيَتَدَارَسُونَهُ فِيمَا بَيْنَهُمْ؛ إلَّا نَزَلَتْ عَلَيْهِمْ السَّكِينَةُ، وَغَشِيَتْهُمْ الرَّحْمَةُ، وَ حَفَّتهُمُ المَلاَئِكَة، وَذَكَرَهُمْ اللَّهُ فِيمَنْ عِنْدَهُ، وَمَنْ أَبَطْأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ\". \n بهذا اللفظ",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (may Allah be pleased with him), that the Prophet (peace and blessings of Allah be upon him) said:",
        "text": "Whoever removes a worldly grief from a believer, Allah will remove from him one of the griefs of the Day of Resurrection. And whoever alleviates the need of a needy person, Allah will alleviate his needs in this world and the Hereafter. Whoever shields  a Muslim, Allah will shield him in this world and the Hereafter. And Allah will aid His slave so long as he aids his brother. And whoever follows a path to seek knowledge therein, Allah will make easy for him a path to Paradise. No people gather together in one of the Houses of Allah, reciting the Book of Allah and studying it among themselves, except that sakeenah (tranquility) descends upon them, and mercy envelops them, and the angels surround them, and Allah mentions them amongst those who are with Him. And whoever is slowed down by his actions, will not be hastened forward by his lineage.\n\nRelated by  in these words."
      },
      "vocabulary": [
        "نفس: فرج وكشف وأزال.",
        "كربة: غم شديد وضيق عظيم.",
        "معسر: مدين عاجز عن السداد.",
        "السكينة: الطمأنينة والوقار.",
        "حفتهم الملائكة: أحاطت بهم.",
        "من بطأ به عمله: من قصر في العمل الصالح لم ينفعه شرف نسبه."
      ],
      "benefits": [
        "فضل نفع الناس والسعي في قضاء حوائجهم.",
        "الجزاء من جنس العمل (تفريج، تيسير، ستر، عون).",
        "فضل مجالس الذكر وتلاوة القرآن.",
        "الاعتبار بالعمل والتقوى لا بالأنساب والأحساب."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "قضاء حوائج المسلمين",
          "التيسير",
          "الستر",
          "الكرب",
          "الحسنة"
        ],
        "english": [
          "Fulfilling Muslims' Needs",
          "Facilitation",
          "Concealment",
          "Distress",
          "Good Deeds"
        ],
        "category_arabic": "الأخوة والتعاون",
        "category_english": "Brotherhood & Cooperation"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ، يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللهُ فِي الدُّنْيَا وَالْآخِرَةِ، وَاَللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ، وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إلَى الْجَنَّةِ، وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ، وَيَتَدَارَسُونَهُ فِيمَا بَيْنَهُمْ؛ إلَّا نَزَلَتْ عَلَيْهِمْ السَّكِينَةُ، وَغَشِيَتْهُمْ الرَّحْمَةُ، وَحَفَّتْهُمُ الْمَلَائِكَةُ، وَذَكَرَهُمْ اللَّهُ فِيمَنْ عِنْدَهُ، وَمَنْ أَبَطْأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ\"",
      "arabic_plain": "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه و سلم قال: \"من نفس عن مؤمن كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة، ومن يسر على معسر، يسر الله عليه في الدنيا والآخرة، ومن ستر مسلما ستره الله في الدنيا والآخرة ، والله في عون العبد ما كان العبد في عون أخيه، ومن سلك طريقا يلتمس فيه علما سهل الله له به طريقا إلى الجنة، وما اجتمع قوم في بيت من بيوت الله يتلون كتاب الله، ويتدارسونه فيما بينهم؛ إلا نزلت عليهم السكينة، وغشيتهم الرحمة، و حفتهم الملائكة، وذكرهم الله فيمن عنده، ومن أبطأ به عمله لم يسرع به نسبه\". \n بهذا اللفظ",
      "arabic_hadith_text_plain": "\"من نفس عن مؤمن كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة، ومن يسر على معسر، يسر الله عليه في الدنيا والآخرة، ومن ستر مسلما ستره الله في الدنيا والآخرة، والله في عون العبد ما كان العبد في عون أخيه، ومن سلك طريقا يلتمس فيه علما سهل الله له به طريقا إلى الجنة، وما اجتمع قوم في بيت من بيوت الله يتلون كتاب الله، ويتدارسونه فيما بينهم؛ إلا نزلت عليهم السكينة، وغشيتهم الرحمة، وحفتهم الملائكة، وذكرهم الله فيمن عنده، ومن أبطأ به عمله لم يسرع به نسبه\"",
      "related_hadiths": [
        13,
        35,
        26
      ]
    },
    {
      "id": 40980,
      "idInBook": 37,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "سعة فضل الله وكتابة الحسنات",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "english": "Abdullah ibn Abbas",
        "kunya_arabic": "أبو العباس",
        "kunya_english": "Abu al-Abbas",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "full_name_english": "Abdullah ibn Abbas",
        "title_arabic": "حبر الأمة، ترجمان القرآن",
        "title_english": "Scholar of the Ummah, Interpreter of the Quran",
        "died_ah": 68,
        "died_ce": 687,
        "tribe_arabic": "قريش - بنو هاشم",
        "tribe_english": "Quraysh - Banu Hashim",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 1660,
        "bio_arabic": "ابن عم النبي ﷺ، دعا له النبي بالفقه في الدين، يُعدّ من أعلم الصحابة بالتفسير والفقه.",
        "bio_english": "Cousin of the Prophet ﷺ, for whom the Prophet supplicated for deep understanding of religion. Considered the most knowledgeable Companion in Quranic interpretation."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه (قدسي)",
        "grade_english": "Agreed Upon - Bukhari & Muslim (Qudsi)"
      },
      "arabic": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، قَالَ: \"إنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ، فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إلَى سَبْعِمِائَةِ ضِعْفٍ إلَى أَضْعَافٍ كَثِيرَةٍ، وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً\". \n \n، ، في \"صحيحيهما\" بهذه الحروف",
      "english": {
        "narrator": "On the authority of Ibn Abbas (may Allah be pleased with him), from the Messenger of Allah (peace and blessings of Allah be upon him), from what he has related from his Lord:",
        "text": "Verily Allah ta’ala has written down the good deeds and the evil deeds, and then explained it  and then performed it, then Allah writes it down as one evil deed.”\n\n\n."
      },
      "vocabulary": [
        "هم بحسنة: عزم عزماً مؤكداً على فعلها.",
        "أضعاف كثيرة: لا حصر لها، بحسب الإخلاص وحال القلب."
      ],
      "benefits": [
        "سعة رحمة الله وفضله في مضاعفة الحسنات.",
        "العدل الإلهي في كتابة السيئة بمثلها دون مضاعفة.",
        "مجرد العزم الصادق على الخير يكتب حسنة وإن لم يفعله.",
        "من ترك المعصية خوفاً من الله كتبت له حسنة."
      ],
      "hadith_type": {
        "type": "qudsi",
        "arabic": "حديث قدسي",
        "english": "Hadith Qudsi (Divine Hadith)"
      },
      "topics": {
        "arabic": [
          "نية الحسنة والسيئة",
          "العمل",
          "القدر",
          "فضل الله",
          "القدسي"
        ],
        "english": [
          "Intention for Good & Evil",
          "Deeds",
          "Divine Decree",
          "Allah's Grace",
          "Qudsi"
        ],
        "category_arabic": "العقيدة والعمل",
        "category_english": "Creed & Deeds"
      },
      "arabic_narrator_intro": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، قَالَ",
      "arabic_hadith_text": "\"إنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ، فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إلَى سَبْعِمِائَةِ ضِعْفٍ إلَى أَضْعَافٍ كَثِيرَةٍ، وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً\"",
      "arabic_plain": "عن ابن عباس رضي الله عنهما عن رسول الله صلى الله عليه و سلم فيما يرويه عن ربه تبارك وتعالى، قال: \"إن الله كتب الحسنات والسيئات، ثم بين ذلك، فمن هم بحسنة فلم يعملها كتبها الله عنده حسنة كاملة، وإن هم بها فعملها كتبها الله عنده عشر حسنات إلى سبعمائة ضعف إلى أضعاف كثيرة، وإن هم بسيئة فلم يعملها كتبها الله عنده حسنة كاملة، وإن هم بها فعملها كتبها الله سيئة واحدة\". \n \n، ، في \"صحيحيهما\" بهذه الحروف",
      "arabic_hadith_text_plain": "\"إن الله كتب الحسنات والسيئات، ثم بين ذلك، فمن هم بحسنة فلم يعملها كتبها الله عنده حسنة كاملة، وإن هم بها فعملها كتبها الله عنده عشر حسنات إلى سبعمائة ضعف إلى أضعاف كثيرة، وإن هم بسيئة فلم يعملها كتبها الله عنده حسنة كاملة، وإن هم بها فعملها كتبها الله سيئة واحدة\"",
      "related_hadiths": [
        2,
        4,
        19,
        24
      ]
    },
    {
      "id": 40981,
      "idInBook": 38,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "طريق الولاية والتقرب إلى الله",
      "narrator": {
        "arabic": "أَبُو هُرَيْرَةَ",
        "english": "Abu Hurayrah",
        "kunya_arabic": "أبو هريرة",
        "kunya_english": "Abu Hurayrah",
        "full_name_arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
        "full_name_english": "Abd al-Rahman ibn Sakhr al-Dawsi",
        "title_arabic": "حافظ الأمة",
        "title_english": "Memorizer of the Ummah",
        "died_ah": 57,
        "died_ce": 678,
        "tribe_arabic": "دوس - اليمن",
        "tribe_english": "Daws - Yemen",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 5374,
        "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
        "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري"
        ],
        "books_english": [
          "Sahih al-Bukhari"
        ],
        "grade_arabic": "رواه البخاري",
        "grade_english": "Narrated by al-Bukhari"
      },
      "arabic": "عَنْ أَبِي هُرَيْرَة رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُول اللَّهِ صلى الله عليه و سلم إنَّ اللَّهَ تَعَالَى قَالَ: \"مَنْ عَادَى لِي وَلِيًّا فَقْد آذَنْتهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ، وَلَا يَزَالُ عَبْدِي يَتَقَرَّبُ إلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْت سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لَأُعْطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ\". \n ",
      "english": {
        "narrator": "On the authority of Abu Hurayrah (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “Verily Allah ta’ala has said: ‘Whosoever shows enmity to a wali (friend) of Mine, then I have declared war against him. And My servant does not draw near to Me with anything more loved to Me than the religious duties I have obligated upon him. And My servant continues to draw near to me with nafil (supererogatory) deeds until I Love him. When I Love him, I am his hearing with which he hears, and his sight with which he sees, and his hand with which he strikes, and his foot with which he walks. Were he to ask  of Me, I would surely give it to him; and were he to seek refuge with Me, I would surely grant him refuge.’ ”\n\n"
      },
      "vocabulary": [
        "ولياً: العالم بالله، المطيع له، المتبع لرسوله.",
        "آذنته بالحرب: أعلنت عليه الحرب.",
        "النوافل: التطوعات الزائدة على الفرائض.",
        "كنت سمعه...: أي لا يسمع ولا يبصر ولا يبطش إلا فيما يرضي الله (تسديد الله له)."
      ],
      "benefits": [
        "خطر معاداة أولياء الله والصالحين.",
        "أحب الأعمال إلى الله أداء الفرائض.",
        "النوافل طريق لمحبة الله ومعيته الخاصة.",
        "من أحبه الله أجاب دعاءه وحفظ جوارحه من الحرام."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "التواضع لله",
          "الصدقة",
          "العفو",
          "رفع الدرجات",
          "أسماء الله"
        ],
        "english": [
          "Humility to Allah",
          "Charity",
          "Forgiveness",
          "Raising Ranks",
          "Allah's Names"
        ],
        "category_arabic": "الأخلاق والعبادة",
        "category_english": "Ethics & Worship"
      },
      "arabic_narrator_intro": "عَنْ أَبِي هُرَيْرَة رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُول اللَّهِ صلى الله عليه و سلم إنَّ اللَّهَ تَعَالَى قَالَ",
      "arabic_hadith_text": "\"مَنْ عَادَى لِي وَلِيًّا فَقْد آذَنْتهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ، وَلَا يَزَالُ عَبْدِي يَتَقَرَّبُ إلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْت سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لَأُعْطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ\"",
      "arabic_plain": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه و سلم إن الله تعالى قال: \"من عادى لي وليا فقد آذنته بالحرب، وما تقرب إلي عبدي بشيء أحب إلي مما افترضته عليه، ولا يزال عبدي يتقرب إلي بالنوافل حتى أحبه، فإذا أحببته كنت سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها، ورجله التي يمشي بها، ولئن سألني لأعطينه، ولئن استعاذني لأعيذنه\". \n ",
      "arabic_hadith_text_plain": "\"من عادى لي وليا فقد آذنته بالحرب، وما تقرب إلي عبدي بشيء أحب إلي مما افترضته عليه، ولا يزال عبدي يتقرب إلي بالنوافل حتى أحبه، فإذا أحببته كنت سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها، ورجله التي يمشي بها، ولئن سألني لأعطينه، ولئن استعاذني لأعيذنه\"",
      "related_hadiths": [
        23,
        25,
        26,
        29
      ]
    },
    {
      "id": 40982,
      "idInBook": 39,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "التجاوز عن الخطأ والنسيان",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "english": "Abdullah ibn Abbas",
        "kunya_arabic": "أبو العباس",
        "kunya_english": "Abu al-Abbas",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
        "full_name_english": "Abdullah ibn Abbas",
        "title_arabic": "حبر الأمة، ترجمان القرآن",
        "title_english": "Scholar of the Ummah, Interpreter of the Quran",
        "died_ah": 68,
        "died_ce": 687,
        "tribe_arabic": "قريش - بنو هاشم",
        "tribe_english": "Quraysh - Banu Hashim",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 1660,
        "bio_arabic": "ابن عم النبي ﷺ، دعا له النبي بالفقه في الدين، يُعدّ من أعلم الصحابة بالتفسير والفقه.",
        "bio_english": "Cousin of the Prophet ﷺ, for whom the Prophet supplicated for deep understanding of religion. Considered the most knowledgeable Companion in Quranic interpretation."
      },
      "source": {
        "books_arabic": [
          "سنن ابن ماجه"
        ],
        "books_english": [
          "Sunan Ibn Majah"
        ],
        "grade_arabic": "حسن",
        "grade_english": "Hasan"
      },
      "arabic": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"إنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ\" . \nحَدِيثٌ حَسَنٌ،",
      "english": {
        "narrator": "On the authority of Ibn Abbas (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:",
        "text": "Verily Allah has pardoned  for me my ummah: their mistakes, their forgetfulness, and that which they have been forced to do under duress.\n\nA hasan hadeeth related by Ibn Majah, and al-Bayhaqee and others."
      },
      "vocabulary": [
        "تجاوز لي: عفا وأسقط الإثم كرامة للنبي ﷺ.",
        "الخطأ: فعل الشيء بغير قصد (ضد العمد).",
        "النسيان: ذهول القلب عن المعلوم.",
        "استكرهوا عليه: أجبروا عليه بالتهديد والقدرة مع عدم الرضا."
      ],
      "benefits": [
        "سماحة الشريعة الإسلامية ورفع الحرج.",
        "رفع الإثم عمن وقع في مخالفة خطأً أو نسياناً أو إكراهاً (ولكن قد يلزمه ضمان مالي أو قضاء حسب الحالة).",
        "العقل والاختيار مناط التكليف."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "العفو",
          "الخطأ",
          "النسيان",
          "الإكراه",
          "رحمة الله"
        ],
        "english": [
          "Pardon",
          "Mistake",
          "Forgetfulness",
          "Compulsion",
          "Allah's Mercy"
        ],
        "category_arabic": "العقيدة والرحمة",
        "category_english": "Creed & Mercy"
      },
      "arabic_narrator_intro": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ",
      "arabic_hadith_text": "\"إنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ\"",
      "arabic_plain": "عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه و سلم قال: \"إن الله تجاوز لي عن أمتي الخطأ والنسيان وما استكرهوا عليه\" . \nحديث حسن،",
      "arabic_hadith_text_plain": "\"إن الله تجاوز لي عن أمتي الخطأ والنسيان وما استكرهوا عليه\"",
      "related_hadiths": [
        38,
        42,
        24,
        18
      ]
    },
    {
      "id": 40983,
      "idInBook": 40,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "كن في الدنيا كأنك غريب",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عُمَرَ",
        "english": "Abdullah ibn Umar",
        "kunya_arabic": "أبو عبد الرحمن",
        "kunya_english": "Abu Abd al-Rahman",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عُمَرَ",
        "full_name_english": "Abdullah ibn Umar",
        "title_arabic": "ابن الفاروق",
        "title_english": "Son of al-Faruq",
        "died_ah": 73,
        "died_ce": 692,
        "tribe_arabic": "قريش - بنو عدي",
        "tribe_english": "Quraysh - Banu Adi",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 2630,
        "bio_arabic": "من أكثر الصحابة رواية للحديث، عُرف بشدة اتباعه لسنة النبي ﷺ حتى في أدق التفاصيل.",
        "bio_english": "One of the most prolific narrators of hadith among the Companions, known for his strict adherence to the Prophet's Sunnah in the finest details."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "سنن الترمذي"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Jami al-Tirmidhi"
        ],
        "grade_arabic": "رواه البخاري والترمذي",
        "grade_english": "Narrated by al-Bukhari and al-Tirmidhi"
      },
      "arabic": "عَنْ ابْن عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللَّهِ صلى الله عليه و سلم بِمَنْكِبِي، وَقَالَ: \"كُنْ فِي الدُّنْيَا كَأَنَّك غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ\". وَكَانَ ابْنُ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُ: إذَا أَمْسَيْتَ فَلَا تَنْتَظِرْ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرْ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِك لِمَرَضِك، وَمِنْ حَيَاتِك لِمَوْتِك. \n ",
      "english": {
        "narrator": "On the authority of Abdullah ibn Umar (may Allah be pleased with him), who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) took me by the shoulder and said, “Be in this world as though you were a stranger or a wayfarer.”\n\nAnd Ibn Umar (may Allah be pleased with him) used to say, “In the evening do not expect  your life before your death.”\n\n"
      },
      "vocabulary": [
        "بمنكبي: مجمع العضد والكتف (للتنبيه والاهتمام).",
        "غريب: ليس له مسكن يأوي إليه.",
        "عابر سبيل: مسافر يمر بالطريق ولا يتوقف.",
        "لا تنتظر الصباح: بادر بالعمل ولا تسوف."
      ],
      "benefits": [
        "قصر الأمل والاستعداد للموت في أي لحظة.",
        "الدنيا دار ممر وليست دار مقر.",
        "الحث على اغتنام الصحة والحياة قبل المرض والموت."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الزهد في الدنيا",
          "الغريب",
          "المسافر",
          "قصر الأمل",
          "الآخرة"
        ],
        "english": [
          "Asceticism",
          "Stranger",
          "Traveler",
          "Short Hopes",
          "Hereafter"
        ],
        "category_arabic": "الزهد",
        "category_english": "Asceticism"
      },
      "arabic_narrator_intro": "عَنْ ابْن عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللَّهِ صلى الله عليه و سلم بِمَنْكِبِي، وَقَالَ",
      "arabic_hadith_text": "\"كُنْ فِي الدُّنْيَا كَأَنَّك غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ\". وَكَانَ ابْنُ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُ: إذَا أَمْسَيْتَ فَلَا تَنْتَظِرْ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرْ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِك لِمَرَضِك، وَمِنْ حَيَاتِك لِمَوْتِك",
      "arabic_plain": "عن ابن عمر رضي الله عنهما قال: أخذ رسول الله صلى الله عليه و سلم بمنكبي، وقال: \"كن في الدنيا كأنك غريب أو عابر سبيل\". وكان ابن عمر رضي الله عنهما يقول: إذا أمسيت فلا تنتظر الصباح، وإذا أصبحت فلا تنتظر المساء، وخذ من صحتك لمرضك، ومن حياتك لموتك. \n ",
      "arabic_hadith_text_plain": "\"كن في الدنيا كأنك غريب أو عابر سبيل\". وكان ابن عمر رضي الله عنهما يقول: إذا أمسيت فلا تنتظر الصباح، وإذا أصبحت فلا تنتظر المساء، وخذ من صحتك لمرضك، ومن حياتك لموتك",
      "related_hadiths": [
        31,
        19,
        12,
        4
      ]
    },
    {
      "id": 40984,
      "idInBook": 41,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "اتباع النبي ﷺ",
      "narrator": {
        "arabic": "عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ",
        "english": "Abdullah ibn Amr ibn al-As",
        "kunya_arabic": "أبو محمد",
        "kunya_english": "Abu Muhammad",
        "full_name_arabic": "عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ",
        "full_name_english": "Abdullah ibn Amr ibn al-As",
        "title_arabic": "العابد الزاهد",
        "title_english": "The Devout Ascetic",
        "died_ah": 65,
        "died_ce": 684,
        "tribe_arabic": "قريش - بنو سهم",
        "tribe_english": "Quraysh - Banu Sahm",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 700,
        "bio_arabic": "من العلماء العباد من الصحابة، أذن له النبي ﷺ بكتابة الحديث، فكتب الصحيفة الصادقة.",
        "bio_english": "One of the scholarly ascetics among the Companions. The Prophet ﷺ permitted him to write hadiths, so he compiled the 'Sahifah al-Sadiqah'."
      },
      "source": {
        "books_arabic": [
          "صحيح البخاري",
          "صحيح مسلم"
        ],
        "books_english": [
          "Sahih al-Bukhari",
          "Sahih Muslim"
        ],
        "grade_arabic": "متفق عليه",
        "grade_english": "Agreed Upon (Bukhari & Muslim)"
      },
      "arabic": "عَنْ أَبِي مُحَمَّدٍ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ\". \nحَدِيثٌ حَسَنٌ صَحِيحٌ، رَوَيْنَاهُ فِي كِتَابِ \"الْحُجَّةِ\" بِإِسْنَادٍ صَحِيحٍ",
      "english": {
        "narrator": "On the authority of Abu Muhammad Abdullah bin ’Amr bin al-’Aas (may Allah be pleased with him) who said:",
        "text": "The Messenger of Allah (peace and blessings of Allah be upon him) said, “None of you  believes until his desires are subservient to that which I have brought.”\n\n We have related it in Kitab al-Hujjah with a saheeh chain of narrators."
      },
      "vocabulary": [
        "هواه: ما تحبه النفس وتميل إليه.",
        "تبعاً: موافقاً ومنقاداً.",
        "لما جئت به: الشريعة والكتاب والسنة."
      ],
      "benefits": [
        "وجوب الانقياد التام لشرع الله ظاهراً وباطناً.",
        "المؤمن الحق يطوع رغباته وميوله لتوافق ما يحبه الله ورسوله.",
        "ذم اتباع الهوى المخالف للشرع."
      ],
      "hadith_type": {
        "type": "marfu",
        "arabic": "حديث مرفوع",
        "english": "Marfu Hadith (Attributed to the Prophet)"
      },
      "topics": {
        "arabic": [
          "الإيمان",
          "اتباع الهوى",
          "شريعة الإسلام",
          "التبعية"
        ],
        "english": [
          "Faith",
          "Following Desires",
          "Islamic Law",
          "Obedience"
        ],
        "category_arabic": "العقيدة والمنهج",
        "category_english": "Creed & Method"
      },
      "arabic_narrator_intro": "عَنْ أَبِي مُحَمَّدٍ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم",
      "arabic_hadith_text": "\"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ\"",
      "arabic_plain": "عن أبي محمد عبد الله بن عمرو بن العاص رضي الله عنهما، قال: قال رسول الله صلى الله عليه و سلم \"لا يؤمن أحدكم حتى يكون هواه تبعا لما جئت به\". \nحديث حسن صحيح، رويناه في كتاب \"الحجة\" بإسناد صحيح",
      "arabic_hadith_text_plain": "\"لا يؤمن أحدكم حتى يكون هواه تبعا لما جئت به\"",
      "related_hadiths": [
        2,
        13,
        15,
        21
      ]
    },
    {
      "id": 40985,
      "idInBook": 42,
      "chapterId": 0,
      "bookId": 10,
      "arabic_title": "سعة مغفرة الله",
      "narrator": {
        "arabic": "أَنَسُ بْنُ مَالِكٍ",
        "english": "Anas ibn Malik",
        "kunya_arabic": "أبو حمزة",
        "kunya_english": "Abu Hamzah",
        "full_name_arabic": "أَنَسُ بْنُ مَالِكٍ الْأَنْصَارِيُّ",
        "full_name_english": "Anas ibn Malik al-Ansari",
        "title_arabic": "خادم رسول الله",
        "title_english": "Servant of the Messenger of Allah",
        "died_ah": 93,
        "died_ce": 712,
        "tribe_arabic": "الخزرج - الأنصار",
        "tribe_english": "Khazraj - Ansar",
        "is_ten_promised_paradise": false,
        "is_companion": true,
        "narrations_count": 2286,
        "bio_arabic": "خدم النبي ﷺ عشر سنوات من حين قدومه المدينة حتى وفاته، آخر من مات من الصحابة في البصرة.",
        "bio_english": "Served the Prophet ﷺ for ten years from his arrival in Madinah until his death. He was the last Companion to die in Basra."
      },
      "source": {
        "books_arabic": [
          "سنن الترمذي"
        ],
        "books_english": [
          "Jami al-Tirmidhi"
        ],
        "grade_arabic": "حسن صحيح",
        "grade_english": "Hasan Sahih"
      },
      "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: قَالَ اللَّهُ تَعَالَى: \"يَا ابْنَ آدَمَ! إِنَّكَ مَا دَعَوْتنِي وَرَجَوْتنِي غَفَرْتُ لَك عَلَى مَا كَانَ مِنْك وَلَا أُبَالِي، يَا ابْنَ آدَمَ! لَوْ بَلَغَتْ ذُنُوبُك عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتنِي غَفَرْتُ لَك، يَا ابْنَ آدَمَ! إنَّك لَوْ أتَيْتنِي بِقُرَابِ الْأَرْضِ خَطَايَا ثُمَّ لَقِيتنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُك بِقُرَابِهَا مَغْفِرَةً\" ",
      "english": {
        "narrator": "On the authority of Anas (may Allah be pleased with him) who said:",
        "text": "I heard the Messenger of Allah (peace and blessings of Allah be upon him) say, “Allah the Almighty has said: ‘O Son of Adam, as long as you invoke Me and ask of Me, I shall forgive you for what you have done, and I shall not mind. O Son of Adam, were your sins to reach the clouds of the sky and you then asked forgiveness from Me, I would forgive you. O Son of Adam, were you to come to Me with sins nearly as great as the Earth, and were you then to face Me, ascribing no partner to Me, I would bring you forgiveness nearly as great as it .’ ” \n\nIt was related by at-Tirmidhi, who said that it was a hasan hadeeth."
      },
      "vocabulary": [
        "عنان السماء: السحاب، أو ما يظهر لك من السماء عند رفع الرأس.",
        "قراب الأرض: ما يقارب ملأها.",
        "لا تشرك بي شيئاً: المات على التوحيد الخالص.",
        "لا أبالي: لا يعظم عليّ ذنبك مهما كثر."
      ],
      "benefits": [
        "فضل الدعاء والرجاء وأنهما سببان للمغفرة.",
        "سعة كرم الله ورحمته التي وسعت كل شيء.",
        "التوحيد هو أعظم أسباب مغفرة الذنوب، والشرك محبط للأعمال."
      ],
      "hadith_type": {
        "type": "qudsi",
        "arabic": "حديث قدسي",
        "english": "Hadith Qudsi (Divine Hadith)"
      },
      "topics": {
        "arabic": [
          "رحمة الله",
          "المغفرة",
          "الدعاء",
          "التوبة",
          "الذنوب",
          "القدسي"
        ],
        "english": [
          "Allah's Mercy",
          "Forgiveness",
          "Supplication",
          "Repentance",
          "Sins",
          "Qudsi"
        ],
        "category_arabic": "التوبة والمغفرة",
        "category_english": "Repentance & Forgiveness"
      },
      "arabic_narrator_intro": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: قَالَ اللَّهُ تَعَالَى",
      "arabic_hadith_text": "\"يَا ابْنَ آدَمَ! إِنَّكَ مَا دَعَوْتنِي وَرَجَوْتنِي غَفَرْتُ لَك عَلَى مَا كَانَ مِنْك وَلَا أُبَالِي، يَا ابْنَ آدَمَ! لَوْ بَلَغَتْ ذُنُوبُك عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتنِي غَفَرْتُ لَك، يَا ابْنَ آدَمَ! إنَّك لَوْ أتَيْتنِي بِقُرَابِ الْأَرْضِ خَطَايَا ثُمَّ لَقِيتنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُك بِقُرَابِهَا مَغْفِرَةً\"",
      "arabic_plain": "عن أنس بن مالك رضي الله عنه قال: سمعت رسول الله صلى الله عليه و سلم يقول: قال الله تعالى: \"يا ابن آدم! إنك ما دعوتني ورجوتني غفرت لك على ما كان منك ولا أبالي، يا ابن آدم! لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك، يا ابن آدم! إنك لو أتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئا لأتيتك بقرابها مغفرة\" ",
      "arabic_hadith_text_plain": "\"يا ابن آدم! إنك ما دعوتني ورجوتني غفرت لك على ما كان منك ولا أبالي، يا ابن آدم! لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك، يا ابن آدم! إنك لو أتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئا لأتيتك بقرابها مغفرة\"",
      "related_hadiths": [
        39,
        10,
        18,
        24
      ]
    }
  ],
  "reference_keys": {
    "narrators_index": {
      "description_ar": "فهرس الرواة المذكورين في الأحاديث",
      "description_en": "Index of narrators mentioned in the hadiths",
      "narrators": [
        {
          "arabic": "عُمَرُ بْنُ الْخَطَّابِ",
          "english": "Umar ibn al-Khattab",
          "kunya_arabic": "أبو حفص",
          "kunya_english": "Abu Hafs",
          "title_arabic": "أمير المؤمنين، الفاروق",
          "title_english": "Amir al-Mu'minin, al-Faruq",
          "died_ah": 23,
          "died_ce": 644,
          "tribe": "قريش - بنو عدي",
          "tribe_en": "Quraysh - Banu Adi",
          "is_ten_promised_paradise": true,
          "is_companion": true,
          "narrations_count": 537,
          "bio_arabic": "ثاني الخلفاء الراشدين، أسلم في السنة السادسة من البعثة، وكان إسلامه فتحاً وعزاً للمسلمين.",
          "bio_english": "Second of the Rightly-Guided Caliphs. Embraced Islam in the sixth year of the prophethood, his conversion was a great strengthening for the Muslims."
        },
        {
          "arabic": "عَبْدُ اللَّهِ بْنُ عُمَرَ",
          "english": "Abdullah ibn Umar",
          "kunya_arabic": "أبو عبد الرحمن",
          "kunya_english": "Abu Abd al-Rahman",
          "title_arabic": "ابن الفاروق",
          "title_english": "Son of al-Faruq",
          "died_ah": 73,
          "died_ce": 692,
          "tribe": "قريش - بنو عدي",
          "tribe_en": "Quraysh - Banu Adi",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 2630,
          "bio_arabic": "من أكثر الصحابة رواية للحديث، عُرف بشدة اتباعه لسنة النبي ﷺ حتى في أدق التفاصيل.",
          "bio_english": "One of the most prolific narrators of hadith among the Companions, known for his strict adherence to the Prophet's Sunnah in the finest details."
        },
        {
          "arabic": "عَبْدُ اللَّهِ بْنُ مَسْعُودٍ",
          "english": "Abdullah ibn Masud",
          "kunya_arabic": "أبو عبد الرحمن",
          "kunya_english": "Abu Abd al-Rahman",
          "title_arabic": "فقيه الأمة",
          "title_english": "Jurist of the Ummah",
          "died_ah": 32,
          "died_ce": 652,
          "tribe": "هذيل",
          "tribe_en": "Hudhayl",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 848,
          "bio_arabic": "من السابقين الأولين إلى الإسلام، كان من أشد الناس معرفة بالقرآن وعلوم الدين.",
          "bio_english": "Among the first to embrace Islam, he was known as one of the most knowledgeable Companions in Quranic sciences and religious knowledge."
        },
        {
          "arabic": "عَائِشَةُ بِنْتُ أَبِي بَكْرٍ",
          "english": "Aisha bint Abi Bakr",
          "kunya_arabic": "أم المؤمنين",
          "kunya_english": "Mother of the Believers",
          "title_arabic": "الصدّيقة بنت الصدّيق",
          "title_english": "al-Siddiqah bint al-Siddiq",
          "died_ah": 57,
          "died_ce": 678,
          "tribe": "قريش - بنو تيم",
          "tribe_en": "Quraysh - Banu Taym",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 2210,
          "bio_arabic": "زوج النبي ﷺ، من أعلم نساء الأمة الإسلامية وأكثرهن رواية للحديث.",
          "bio_english": "Wife of the Prophet ﷺ, one of the most knowledgeable women in Islamic history and among the most prolific narrators of hadith."
        },
        {
          "arabic": "عَبْدُ الرَّحْمَنِ بْنُ صَخْرٍ الدَّوْسِيُّ",
          "english": "Abd al-Rahman ibn Sakhr al-Dawsi",
          "kunya_arabic": "أبو هريرة",
          "kunya_english": "Abu Hurayrah",
          "title_arabic": "حافظ الأمة",
          "title_english": "Memorizer of the Ummah",
          "died_ah": 57,
          "died_ce": 678,
          "tribe": "دوس - اليمن",
          "tribe_en": "Daws - Yemen",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 5374,
          "bio_arabic": "أكثر الصحابة رواية للحديث على الإطلاق، أسلم عام خيبر سنة 7 هـ وصحب النبي ﷺ قرابة أربع سنوات.",
          "bio_english": "The most prolific narrator of hadith among all Companions. Embraced Islam in the year of Khaybar (7 AH) and accompanied the Prophet ﷺ for approximately four years."
        },
        {
          "arabic": "أَنَسُ بْنُ مَالِكٍ الْأَنْصَارِيُّ",
          "english": "Anas ibn Malik al-Ansari",
          "kunya_arabic": "أبو حمزة",
          "kunya_english": "Abu Hamzah",
          "title_arabic": "خادم رسول الله",
          "title_english": "Servant of the Messenger of Allah",
          "died_ah": 93,
          "died_ce": 712,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 2286,
          "bio_arabic": "خدم النبي ﷺ عشر سنوات من حين قدومه المدينة حتى وفاته، آخر من مات من الصحابة في البصرة.",
          "bio_english": "Served the Prophet ﷺ for ten years from his arrival in Madinah until his death. He was the last Companion to die in Basra."
        },
        {
          "arabic": "عَبْدُ اللَّهِ بْنُ عَبَّاسٍ",
          "english": "Abdullah ibn Abbas",
          "kunya_arabic": "أبو العباس",
          "kunya_english": "Abu al-Abbas",
          "title_arabic": "حبر الأمة، ترجمان القرآن",
          "title_english": "Scholar of the Ummah, Interpreter of the Quran",
          "died_ah": 68,
          "died_ce": 687,
          "tribe": "قريش - بنو هاشم",
          "tribe_en": "Quraysh - Banu Hashim",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 1660,
          "bio_arabic": "ابن عم النبي ﷺ، دعا له النبي بالفقه في الدين، يُعدّ من أعلم الصحابة بالتفسير والفقه.",
          "bio_english": "Cousin of the Prophet ﷺ, for whom the Prophet supplicated for deep understanding of religion. Considered the most knowledgeable Companion in Quranic interpretation."
        },
        {
          "arabic": "النُّعْمَانُ بْنُ بَشِيرٍ الْأَنْصَارِيُّ",
          "english": "al-Nu'man ibn Bashir al-Ansari",
          "kunya_arabic": "أبو عبد الله",
          "kunya_english": "Abu Abdullah",
          "title_arabic": "",
          "title_english": "",
          "died_ah": 65,
          "died_ce": 684,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 114,
          "bio_arabic": "أول مولود من الأنصار بعد الهجرة، ولاّه معاوية رضي الله عنه على الكوفة والشام.",
          "bio_english": "The first child born to the Ansar after the Hijra. Muawiyah appointed him governor of Kufa and later Syria."
        },
        {
          "arabic": "تَمِيمُ بْنُ أَوْسٍ الدَّارِيُّ",
          "english": "Tamim ibn Aws al-Dari",
          "kunya_arabic": "أبو رقية",
          "kunya_english": "Abu Ruqayyah",
          "title_arabic": "الراهب",
          "title_english": "The Devout Worshipper",
          "died_ah": 40,
          "died_ce": 661,
          "tribe": "لخم",
          "tribe_en": "Lakhm",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 18,
          "bio_arabic": "كان نصرانياً فأسلم سنة 9 هـ، مشهور بطول القيام في الصلاة وكثرة العبادة.",
          "bio_english": "Was a Christian who embraced Islam in 9 AH. Known for his lengthy night prayers and abundant worship."
        },
        {
          "arabic": "الْحَسَنُ بْنُ عَلِيِّ بْنِ أَبِي طَالِبٍ",
          "english": "al-Hasan ibn Ali ibn Abi Talib",
          "kunya_arabic": "أبو محمد",
          "kunya_english": "Abu Muhammad",
          "title_arabic": "سبط رسول الله، ريحانته",
          "title_english": "Grandson of the Messenger of Allah, His Beloved",
          "died_ah": 50,
          "died_ce": 670,
          "tribe": "قريش - بنو هاشم",
          "tribe_en": "Quraysh - Banu Hashim",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 13,
          "bio_arabic": "سبط النبي ﷺ وريحانته، تنازل عن الخلافة لمعاوية حقناً للدماء.",
          "bio_english": "Grandson of the Prophet ﷺ, relinquished the caliphate to Muawiyah to prevent bloodshed."
        },
        {
          "arabic": "شَدَّادُ بْنُ أَوْسٍ الْأَنْصَارِيُّ",
          "english": "Shaddad ibn Aws al-Ansari",
          "kunya_arabic": "أبو يعلى",
          "kunya_english": "Abu Ya'la",
          "title_arabic": "",
          "title_english": "",
          "died_ah": 58,
          "died_ce": 677,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 50,
          "bio_arabic": "صحابي جليل سكن بيت المقدس، وصفه النبي ﷺ بأنه من الفقهاء والحكماء.",
          "bio_english": "A distinguished Companion who settled in Jerusalem. The Prophet ﷺ described him as one of the jurists and wise men."
        },
        {
          "arabic": "جُنْدَبُ بْنُ جُنَادَةَ الْغِفَارِيُّ",
          "english": "Jundub ibn Junadah al-Ghifari",
          "kunya_arabic": "أبو ذر",
          "kunya_english": "Abu Dharr",
          "title_arabic": "الصادق الزاهد",
          "title_english": "The Truthful Ascetic",
          "died_ah": 32,
          "died_ce": 652,
          "tribe": "غفار",
          "tribe_en": "Ghifar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 281,
          "bio_arabic": "من السابقين الأولين إلى الإسلام، مشهور بزهده وشدة صدقه، أوصاه النبي ﷺ بوصايا عظيمة.",
          "bio_english": "Among the earliest converts to Islam, known for his asceticism and extreme truthfulness. The Prophet ﷺ gave him great counsel."
        },
        {
          "arabic": "أَبُو ذَرٍّ الْغِفَارِيُّ وَمُعَاذُ بْنُ جَبَلٍ",
          "english": "Abu Dharr al-Ghifari and Muadh ibn Jabal",
          "kunya_arabic": "أبو ذر وأبو عبد الرحمن",
          "kunya_english": "Abu Dharr and Abu Abd al-Rahman",
          "title_arabic": "صحابيان جليلان",
          "title_english": "Two Distinguished Companions",
          "died_ah": 32,
          "died_ce": 652,
          "tribe": "غفار والخزرج",
          "tribe_en": "Ghifar and Khazraj",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": null,
          "bio_arabic": "حديث روي عن صحابيين جليلين: أبو ذر الغفاري ومعاذ بن جبل رضي الله عنهما.",
          "bio_english": "Hadith narrated from two distinguished Companions: Abu Dharr al-Ghifari and Muadh ibn Jabal."
        },
        {
          "arabic": "النَّوَّاسُ بْنُ سَمْعَانَ الْأَنْصَارِيُّ",
          "english": "al-Nawwas ibn Sam'an al-Ansari",
          "kunya_arabic": "",
          "kunya_english": "",
          "title_arabic": "",
          "title_english": "",
          "died_ah": null,
          "died_ce": null,
          "tribe": "كلاب",
          "tribe_en": "Kilab",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 16,
          "bio_arabic": "صحابي من أهل الشام، روى عنه جماعة من التابعين.",
          "bio_english": "A Companion from Syria, narrated from by a group of Tabiun."
        },
        {
          "arabic": "الْعِرْبَاضُ بْنُ سَارِيَةَ السُّلَمِيُّ",
          "english": "al-Irbad ibn Sariyah al-Sulami",
          "kunya_arabic": "أبو نجيح",
          "kunya_english": "Abu Najeeh",
          "title_arabic": "من أهل الصفة",
          "title_english": "From the People of the Suffah",
          "died_ah": 75,
          "died_ce": 694,
          "tribe": "سليم",
          "tribe_en": "Sulaym",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 30,
          "bio_arabic": "من أهل الصفة، سكن حمص بالشام، روى موعظة النبي ﷺ المؤثرة التي بكى منها الصحابة.",
          "bio_english": "From the People of the Suffah, settled in Homs, Syria. He narrated the moving sermon of the Prophet ﷺ that moved the Companions to tears."
        },
        {
          "arabic": "مُعَاذُ بْنُ جَبَلٍ الْأَنْصَارِيُّ",
          "english": "Muadh ibn Jabal al-Ansari",
          "kunya_arabic": "أبو عبد الرحمن",
          "kunya_english": "Abu Abd al-Rahman",
          "title_arabic": "أعلم الأمة بالحلال والحرام",
          "title_english": "Most Knowledgeable of the Ummah in Halal & Haram",
          "died_ah": 18,
          "died_ce": 639,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 157,
          "bio_arabic": "قال عنه النبي ﷺ: \"أعلم أمتي بالحلال والحرام معاذ بن جبل\"، بعثه النبي معلماً لليمن.",
          "bio_english": "The Prophet ﷺ said about him: 'The most knowledgeable of my Ummah regarding halal and haram is Muadh ibn Jabal.' The Prophet sent him as a teacher to Yemen."
        },
        {
          "arabic": "جُرْثُومُ بْنُ نَاشِرٍ الْخُشَنِيُّ",
          "english": "Jurthum ibn Nashir al-Khushani",
          "kunya_arabic": "أبو ثعلبة",
          "kunya_english": "Abu Tha'labah",
          "title_arabic": "",
          "title_english": "",
          "died_ah": 75,
          "died_ce": 694,
          "tribe": "خشين",
          "tribe_en": "Khushayn",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 12,
          "bio_arabic": "صحابي جليل، شهد بيعة الرضوان، روى أحاديث في الحلال والحرام والفقه.",
          "bio_english": "A distinguished Companion who witnessed the Bay'at al-Ridwan. Narrated hadiths on halal, haram, and jurisprudence."
        },
        {
          "arabic": "سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ",
          "english": "Sahl ibn Sa'd al-Sa'idi",
          "kunya_arabic": "أبو العباس",
          "kunya_english": "Abu al-Abbas",
          "title_arabic": "آخر من مات من الصحابة بالمدينة",
          "title_english": "Last Companion to die in Madinah",
          "died_ah": 91,
          "died_ce": 710,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 188,
          "bio_arabic": "عاش حتى بلغ مئة سنة، وكان آخر من مات من الصحابة في المدينة المنورة.",
          "bio_english": "Lived to the age of one hundred, and was the last Companion to die in Madinah."
        },
        {
          "arabic": "سَعْدُ بْنُ مَالِكٍ الْخُدْرِيُّ",
          "english": "Sa'd ibn Malik al-Khudri",
          "kunya_arabic": "أبو سعيد",
          "kunya_english": "Abu Sa'id",
          "title_arabic": "المفتي",
          "title_english": "The Jurist",
          "died_ah": 74,
          "died_ce": 693,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 1170,
          "bio_arabic": "من أكثر الصحابة فتوى ورواية، شهد المشاهد كلها مع النبي ﷺ ما عدا بدراً.",
          "bio_english": "One of the most prolific in issuing fatwas and narrating hadiths. Witnessed all battles with the Prophet ﷺ except Badr."
        },
        {
          "arabic": "سُفْيَانُ بْنُ عَبْدِ اللَّهِ الثَّقَفِيُّ",
          "english": "Sufyan ibn Abdullah al-Thaqafi",
          "kunya_arabic": "أبو عمرو",
          "kunya_english": "Abu Amr",
          "title_arabic": "",
          "title_english": "",
          "died_ah": null,
          "died_ce": null,
          "tribe": "ثقيف",
          "tribe_en": "Thaqif",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 5,
          "bio_arabic": "صحابي من ثقيف، روى أحاديث قليلة لكنها جامعة لأصول عظيمة من الدين.",
          "bio_english": "A Companion from the Thaqif tribe. Narrated few hadiths but they contain great foundational principles of religion."
        },
        {
          "arabic": "جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ",
          "english": "Jabir ibn Abdullah al-Ansari",
          "kunya_arabic": "أبو عبد الله",
          "kunya_english": "Abu Abdullah",
          "title_arabic": "مفتي المدينة",
          "title_english": "Mufti of Madinah",
          "died_ah": 78,
          "died_ce": 697,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 1540,
          "bio_arabic": "من أكثر الصحابة رواية للحديث، شهد بيعة العقبة الثانية وغزوات كثيرة مع النبي ﷺ.",
          "bio_english": "One of the most prolific narrators among the Companions. Witnessed the Second Pledge of Aqabah and many battles with the Prophet ﷺ."
        },
        {
          "arabic": "الْحَارِثُ بْنُ عَاصِمٍ الْأَشْعَرِيُّ",
          "english": "al-Harith ibn Asim al-Ash'ari",
          "kunya_arabic": "أبو مالك",
          "kunya_english": "Abu Malik",
          "title_arabic": "",
          "title_english": "",
          "died_ah": null,
          "died_ce": null,
          "tribe": "الأشعريون",
          "tribe_en": "Ash'ariyun",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 7,
          "bio_arabic": "صحابي أشعري، روى هذا الحديث الجامع في فضل الطهارة والأعمال الصالحة.",
          "bio_english": "An Ash'ari Companion who narrated this comprehensive hadith on the virtues of purity and righteous deeds."
        },
        {
          "arabic": "عُقْبَةُ بْنُ عَمْرٍو الْأَنْصَارِيُّ",
          "english": "Uqbah ibn Amr al-Ansari",
          "kunya_arabic": "أبو مسعود",
          "kunya_english": "Abu Masood",
          "title_arabic": "البدري",
          "title_english": "al-Badri (of Badr)",
          "died_ah": 40,
          "died_ce": 660,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 102,
          "bio_arabic": "صحابي أنصاري نسب إلى بدر لسكنه قريباً منها، ولي الكوفة في عهد علي رضي الله عنه.",
          "bio_english": "An Ansari Companion attributed to Badr due to his residence nearby. Governed Kufa during Ali's caliphate."
        },
        {
          "arabic": "عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ",
          "english": "Abdullah ibn Amr ibn al-As",
          "kunya_arabic": "أبو محمد",
          "kunya_english": "Abu Muhammad",
          "title_arabic": "العابد الزاهد",
          "title_english": "The Devout Ascetic",
          "died_ah": 65,
          "died_ce": 684,
          "tribe": "قريش - بنو سهم",
          "tribe_en": "Quraysh - Banu Sahm",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 700,
          "bio_arabic": "من العلماء العباد من الصحابة، أذن له النبي ﷺ بكتابة الحديث، فكتب الصحيفة الصادقة.",
          "bio_english": "One of the scholarly ascetics among the Companions. The Prophet ﷺ permitted him to write hadiths, so he compiled the 'Sahifah al-Sadiqah'."
        },
        {
          "arabic": "سَعْدُ بْنُ مَالِكٍ بْنِ سِنَانٍ الْخُدْرِيُّ",
          "english": "Sa'd ibn Malik ibn Sinan al-Khudri",
          "kunya_arabic": "أبو سعيد",
          "kunya_english": "Abu Sa'id",
          "title_arabic": "",
          "title_english": "",
          "died_ah": 74,
          "died_ce": 693,
          "tribe": "الخزرج - الأنصار",
          "tribe_en": "Khazraj - Ansar",
          "is_ten_promised_paradise": false,
          "is_companion": true,
          "narrations_count": 1170,
          "bio_arabic": "من فقهاء الصحابة ومكثريهم في الرواية، استشهد أبوه في غزوة أحد.",
          "bio_english": "One of the most learned and prolific Companions in narration. His father was martyred at the Battle of Uhud."
        }
      ]
    },
    "sources_index": {
      "description_ar": "فهرس كتب الحديث المصدرية",
      "description_en": "Index of hadith source books",
      "books": [
        {
          "arabic": "صحيح البخاري",
          "english": "Sahih al-Bukhari",
          "author_ar": "الإمام محمد بن إسماعيل البخاري",
          "author_en": "Imam Muhammad ibn Ismail al-Bukhari"
        },
        {
          "arabic": "صحيح مسلم",
          "english": "Sahih Muslim",
          "author_ar": "الإمام مسلم بن الحجاج",
          "author_en": "Imam Muslim ibn al-Hajjaj"
        },
        {
          "arabic": "سنن الترمذي",
          "english": "Jami al-Tirmidhi",
          "author_ar": "الإمام أبو عيسى الترمذي",
          "author_en": "Imam Abu Isa al-Tirmidhi"
        },
        {
          "arabic": "سنن أبي داود",
          "english": "Sunan Abu Dawud",
          "author_ar": "الإمام أبو داود السجستاني",
          "author_en": "Imam Abu Dawud al-Sijistani"
        },
        {
          "arabic": "سنن النسائي",
          "english": "Sunan an-Nasai",
          "author_ar": "الإمام أحمد بن شعيب النسائي",
          "author_en": "Imam Ahmad ibn Shu'ayb al-Nasai"
        },
        {
          "arabic": "سنن ابن ماجه",
          "english": "Sunan Ibn Majah",
          "author_ar": "الإمام محمد بن يزيد ابن ماجه",
          "author_en": "Imam Muhammad ibn Yazid Ibn Majah"
        },
        {
          "arabic": "مسند أحمد",
          "english": "Musnad Ahmad",
          "author_ar": "الإمام أحمد بن حنبل",
          "author_en": "Imam Ahmad ibn Hanbal"
        },
        {
          "arabic": "سنن الدارقطني",
          "english": "Sunan al-Daraqutni",
          "author_ar": "الإمام علي بن عمر الدارقطني",
          "author_en": "Imam Ali ibn Umar al-Daraqutni"
        },
        {
          "arabic": "سنن البيهقي",
          "english": "Sunan al-Bayhaqi",
          "author_ar": "الإمام أحمد بن الحسين البيهقي",
          "author_en": "Imam Ahmad ibn al-Husayn al-Bayhaqi"
        },
        {
          "arabic": "موطأ مالك",
          "english": "Muwatta Malik",
          "author_ar": "الإمام مالك بن أنس",
          "author_en": "Imam Malik ibn Anas"
        }
      ]
    },
    "grades_index": {
      "description_ar": "درجات الحديث",
      "description_en": "Hadith authentication grades",
      "grades": [
        {
          "arabic": "متفق عليه",
          "english": "Agreed Upon (Muttafaq Alayh)",
          "explanation_ar": "رواه البخاري ومسلم كلاهما",
          "explanation_en": "Narrated by both al-Bukhari and Muslim"
        },
        {
          "arabic": "صحيح",
          "english": "Sahih (Authentic)",
          "explanation_ar": "حديث صحيح الإسناد",
          "explanation_en": "Hadith with an authentic chain of narration"
        },
        {
          "arabic": "حسن",
          "english": "Hasan (Good)",
          "explanation_ar": "حديث حسن الإسناد",
          "explanation_en": "Hadith with a good chain of narration"
        },
        {
          "arabic": "حسن صحيح",
          "english": "Hasan Sahih",
          "explanation_ar": "حديث بين الحسن والصحيح",
          "explanation_en": "Hadith classified between Hasan and Sahih"
        },
        {
          "arabic": "قدسي",
          "english": "Qudsi (Divine)",
          "explanation_ar": "حديث يرويه النبي ﷺ عن ربه",
          "explanation_en": "Hadith narrated by the Prophet from his Lord"
        }
      ]
    },
    "topics_index": {
      "description_ar": "تصنيف الأحاديث حسب الموضوع",
      "description_en": "Classification of hadiths by topic",
      "categories": [
        {
          "arabic": "العقيدة والأخلاق",
          "english": "Creed & Ethics"
        },
        {
          "arabic": "أركان الدين",
          "english": "Pillars of Religion"
        },
        {
          "arabic": "العبادات",
          "english": "Acts of Worship"
        },
        {
          "arabic": "العقيدة",
          "english": "Creed"
        },
        {
          "arabic": "الفقه والشريعة",
          "english": "Jurisprudence & Law"
        },
        {
          "arabic": "الأخلاق والورع",
          "english": "Ethics & Piety"
        },
        {
          "arabic": "الأخلاق والمجتمع",
          "english": "Ethics & Society"
        },
        {
          "arabic": "الجهاد والعقيدة",
          "english": "Jihad & Creed"
        },
        {
          "arabic": "الفقه والمنهج",
          "english": "Jurisprudence & Method"
        },
        {
          "arabic": "الأخلاق والعبادة",
          "english": "Ethics & Worship"
        },
        {
          "arabic": "الورع والزهد",
          "english": "Piety & Asceticism"
        },
        {
          "arabic": "الأخلاق",
          "english": "Ethics"
        },
        {
          "arabic": "الأخوة الإسلامية",
          "english": "Islamic Brotherhood"
        },
        {
          "arabic": "الفقه الجنائي",
          "english": "Criminal Jurisprudence"
        },
        {
          "arabic": "الأخلاق الاجتماعية",
          "english": "Social Ethics"
        },
        {
          "arabic": "الأخلاق والفقه",
          "english": "Ethics & Jurisprudence"
        },
        {
          "arabic": "الأخلاق والتوبة",
          "english": "Ethics & Repentance"
        },
        {
          "arabic": "التوكل والعقيدة",
          "english": "Reliance & Creed"
        },
        {
          "arabic": "الاستقامة",
          "english": "Uprightness"
        },
        {
          "arabic": "العبادات التطوعية",
          "english": "Voluntary Worship"
        },
        {
          "arabic": "الأعمال الصالحة",
          "english": "Righteous Deeds"
        },
        {
          "arabic": "المنهج والسنة",
          "english": "Method & Sunnah"
        },
        {
          "arabic": "العبادات والأخلاق",
          "english": "Worship & Ethics"
        },
        {
          "arabic": "الزهد والأخلاق",
          "english": "Asceticism & Ethics"
        },
        {
          "arabic": "القواعد الفقهية",
          "english": "Legal Maxims"
        },
        {
          "arabic": "القضاء والفقه",
          "english": "Judiciary & Jurisprudence"
        },
        {
          "arabic": "الأمر بالمعروف والنهي عن المنكر",
          "english": "Enjoining Good & Forbidding Evil"
        },
        {
          "arabic": "الأخوة والتعاون",
          "english": "Brotherhood & Cooperation"
        },
        {
          "arabic": "العقيدة والعمل",
          "english": "Creed & Deeds"
        },
        {
          "arabic": "العقيدة والرحمة",
          "english": "Creed & Mercy"
        },
        {
          "arabic": "الزهد",
          "english": "Asceticism"
        },
        {
          "arabic": "العقيدة والمنهج",
          "english": "Creed & Method"
        },
        {
          "arabic": "التوبة والمغفرة",
          "english": "Repentance & Forgiveness"
        }
      ]
    },
    "hadith_types_index": {
      "description_ar": "أنواع الأحاديث",
      "description_en": "Types of hadiths",
      "types": [
        {
          "type": "marfu",
          "arabic": "حديث مرفوع",
          "english": "Marfu Hadith",
          "explanation_ar": "ما أُسند إلى النبي ﷺ قولاً أو فعلاً أو تقريراً",
          "explanation_en": "Hadith attributed to the Prophet ﷺ in speech, action, or approval"
        },
        {
          "type": "qudsi",
          "arabic": "حديث قدسي",
          "english": "Hadith Qudsi",
          "explanation_ar": "ما يرويه النبي ﷺ عن الله تعالى بغير القرآن الكريم",
          "explanation_en": "Hadith narrated by the Prophet ﷺ from Allah, other than the Quran"
        }
      ]
    }
  }
}